{
  "source_file": "C:\\Users\\joshu\\OneDrive\\Informatikstudium\\Bachelor\\pdf-reader\\pdfs\\2-aend-19-02-25_msc-computer-science_lese.pdf",
  "document_id": "2-aend-19-02-25_msc-computer-science_lese",
  "config": {
    "max_chunk_tokens": 512,
    "overlap_tokens": 100,
    "min_chunk_tokens": 50
  },
  "chunks": [
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0000",
      "text": "Diese Seite enthält die nichtamtliche Lesefassung der Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)' an der Philipps-Universität Marburg. Die Ordnung basiert auf den Allgemeinen Bestimmungen für Masterstudiengänge der Universität vom 13. September 2010. Die Lesefassung wurde zur besseren Verständlichkeit überarbeitet und umfasst die ursprüngliche Fassung vom 25. Januar 2023 sowie die Änderungen vom 13. März 2024 und 19. Februar 2025. Die Rechtsverbindlichkeit bleibt durch die Veröffentlichung in den Amtlichen Mitteilungen der Universität unberührt. Der Fachbereichsrat des Fachbereichs Mathematik und Informatik hat die Ordnung gemäß § 50 Abs. 1 des Hessischen Hochschulgesetzes beschlossen. Die aktuelle Fassung wurde am 19. Februar 2025 veröffentlicht. Das Inhaltsverzeichnis der Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)' an der Philipps-Universität Marburg ist in vier Hauptabschnitte unterteilt. Der erste Abschnitt behandelt allgemeine Bestimmungen, einschließlich des Geltungsbereichs, der Ziele des Studiums und des Mastergrads. Der zweite Abschnitt umfasst studienbezogene Bestimmungen wie Zugangsvoraussetzungen, Studienberatung, den Aufbau des Studiums, Regelstudienzeiten, Studienaufenthalte im Ausland, Strukturvarianten des Studiengangs, Module und Leistungspunkte, Praxismodule, Modul- und Veranstaltungsanmeldungen sowie den Zugang zu Wahlpflichtmodulen.",
      "token_count": 441,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          1,
          2
        ],
        "chunk_index": 0,
        "total_chunks": 67,
        "prev_chunk_id": null,
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0001"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0001",
      "text": "Der zweite Abschnitt umfasst studienbezogene Bestimmungen wie Zugangsvoraussetzungen, Studienberatung, den Aufbau des Studiums, Regelstudienzeiten, Studienaufenthalte im Ausland, Strukturvarianten des Studiengangs, Module und Leistungspunkte, Praxismodule, Modul- und Veranstaltungsanmeldungen sowie den Zugang zu Wahlpflichtmodulen. Der dritte Abschnitt befasst sich mit prüfungsbezogenen Bestimmungen, darunter der Prüfungsausschuss, Aufgaben der Prüfungsverwaltung, Anerkennung von Studienleistungen, Prüfungsformen, Masterarbeit, Prüfungsanmeldung, Leistungsbewertung und Notenbildung. Der vierte Abschnitt enthält Schlussbestimmungen wie die Einsicht in Prüfungsunterlagen und Übergangsbestimmungen. Zudem gibt es mehrere Anlagen, die exemplarische Studienverlaufspläne, Modullisten und besondere Zugangsvoraussetzungen umfassen. Die Studien- und Prüfungsordnung ergänzt die Allgemeinen Bestimmungen für Masterstudiengänge an der Philipps-Universität Marburg. Sie legt die Ziele, Inhalte und Anforderungen des Studiengangs 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)' fest. Absolventen des Masterstudiengangs 'Computer Science' verfügen über vertiefte Kenntnisse in Informatik und sind in der Lage, wissenschaftliche Probleme eigenverantwortlich zu bearbeiten. Sie können in verschiedenen Bereichen wie Industrie, Wirtschaft und öffentlichem Dienst tätig werden und sind auch für eine Promotion qualifiziert. Der Mastergrad wird verliehen, wenn alle Module gemäß § 6 bestanden sind. Die Zugangsvoraussetzung für den Masterstudiengang ist der Nachweis eines einschlägigen Bachelorabschlusses in Informatik oder einer vergleichbaren Qualifikation.",
      "token_count": 472,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          2,
          3
        ],
        "chunk_index": 1,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0000",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0002"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0002",
      "text": "Absolventen des Masterstudiengangs 'Computer Science' verfügen über vertiefte Kenntnisse in Informatik und sind in der Lage, wissenschaftliche Probleme eigenverantwortlich zu bearbeiten. Sie können in verschiedenen Bereichen wie Industrie, Wirtschaft und öffentlichem Dienst tätig werden und sind auch für eine Promotion qualifiziert. Der Mastergrad wird verliehen, wenn alle Module gemäß § 6 bestanden sind. Die Zugangsvoraussetzung für den Masterstudiengang ist der Nachweis eines einschlägigen Bachelorabschlusses in Informatik oder einer vergleichbaren Qualifikation. Neben dem Bachelor im Studiengang Informatik berechtigt ein Abschluss für das Lehramt an Gymnasien oder Master mit dem Unterrichtsfach Informatik zum Zugang. Der Hochschulabschluss muss mit einer Gesamtnote von 3,2 oder besser gemäß § 28 bestanden sein. Im Rahmen des absolvierten Studiengangs müssen mindestens 90 Leistungspunkte in Mathematik und Informatik absolviert worden sein. Davon müssen mindestens 12 Leistungspunkte aus der Mathematik und 72 Leistungspunkte aus der Informatik stammen. In der Mathematik sind Kompetenzen in Grundlagen der Analysis, der Linearen Algebra und der Statistik erforderlich. In der Informatik müssen mindestens 9 Leistungspunkte aus dem Modul Theoretische Informatik sowie Kompetenzen aus mindestens 5 der folgenden Module nachgewiesen werden: Algorithmen und Datenstrukturen, Deklarative Programmierung, Objektorientierte Programmierung, Systemsoftware, Rechnerkommunikation, Datenbanksysteme, Softwaretechnik und Technische Informatik. Es wird empfohlen, fehlende Kompetenzen vor Studienbeginn nachzuweisen. Bei fehlendem Abschlusszeugnis kann eine Einschreibung unter Vorbehalt erfolgen, wenn 80% der erforderlichen Leistungspunkte nachgewiesen werden. Der Nachweis muss eine Durchschnittsnote enthalten.",
      "token_count": 482,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          3,
          4
        ],
        "chunk_index": 2,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0001",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0003"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0003",
      "text": "In der Informatik müssen mindestens 9 Leistungspunkte aus dem Modul Theoretische Informatik sowie Kompetenzen aus mindestens 5 der folgenden Module nachgewiesen werden: Algorithmen und Datenstrukturen, Deklarative Programmierung, Objektorientierte Programmierung, Systemsoftware, Rechnerkommunikation, Datenbanksysteme, Softwaretechnik und Technische Informatik. Es wird empfohlen, fehlende Kompetenzen vor Studienbeginn nachzuweisen. Bei fehlendem Abschlusszeugnis kann eine Einschreibung unter Vorbehalt erfolgen, wenn 80% der erforderlichen Leistungspunkte nachgewiesen werden. Der Nachweis muss eine Durchschnittsnote enthalten. Eine Einschreibung kann unter dem Vorbehalt erfolgen, dass alle Leistungen bis zum Ende des ersten Fachsemesters erbracht werden. (2) Über die fachliche Eignung entscheidet die Eignungsfeststellungskommission gemäß Anlage 5. (3) Über die Vergleichbarkeit des Hochschulabschlusses entscheidet ebenfalls die Eignungsfeststellungskommission. (4) Die Module werden in der Regel in englischer Sprache angeboten. Ein deutschsprachiges Angebot ist möglich, wenn alle Studierenden dies wünschen. Die Prüfungsleistungen können in deutscher oder englischer Sprache abgelegt werden. Die besonderen Zugangsvoraussetzungen sind: Es sind entweder... Um die englischen Sprachkenntnisse auf dem Niveau C1 des Gemeinsamen Europäischen Referenzrahmens für Sprachen nachzuweisen, kann eines der folgenden international anerkannten Sprachzertifikate vorgelegt werden: Beim International English Language Testing System (IELTS) sind Ergebnisse von 7.0, 7.5 oder 8.0 erforderlich. Für den Test of English as a Foreign Language (TOEFL) werden beim iBT 95 bis 120 Punkte und beim PBT sowie ITP Level 1 jeweils 627 bis 677 Punkte benötigt.",
      "token_count": 481,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          4,
          5
        ],
        "chunk_index": 3,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0002",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0004"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0004",
      "text": "Um die englischen Sprachkenntnisse auf dem Niveau C1 des Gemeinsamen Europäischen Referenzrahmens für Sprachen nachzuweisen, kann eines der folgenden international anerkannten Sprachzertifikate vorgelegt werden: Beim International English Language Testing System (IELTS) sind Ergebnisse von 7.0, 7.5 oder 8.0 erforderlich. Für den Test of English as a Foreign Language (TOEFL) werden beim iBT 95 bis 120 Punkte und beim PBT sowie ITP Level 1 jeweils 627 bis 677 Punkte benötigt. Das Cambridge English Language Assessment akzeptiert das First Certificate in English mit Grade A (FCE), das Certificate of Advanced English mit Grade B oder C (CAE) und das Cambridge English: Business Higher (BEC Higher). Der Pearson PTE Academic erfordert 76 bis 84 Punkte. Der Test of English for International Communication (TOEIC) verlangt beim Listening and Reading Test 945 bis 990 Punkte, beim Speaking Test 180 bis 200 Punkte und beim Writing Test ebenfalls 180 bis 200 Punkte. Das telc C1-Zertifikat und das UNIcert III werden ebenfalls anerkannt. Für das Cambridge IGCSE müssen alle vier Einzelprüfungen des IGCSE 1st Language oder des IGCSE 2nd Language mit Durchschnitt C1 bestanden werden. Alternativ können englische Sprachkenntnisse auf dem Niveau B1 und deutsche Sprachkenntnisse entsprechend der Sprachprüfung DSH-2 nachgewiesen werden. Neben den allgemeinen Zugangsvoraussetzungen kann die Teilnahme an einzelnen Modulen von spezifischen Modulvoraussetzungen abhängig gemacht werden, die in der Modulliste (Anlage 2) unter 'Voraussetzungen für die Teilnahme' aufgeführt sind. Die allgemeine Studienberatung erfolgt durch die Zentrale Allgemeine Studienberatung der Philipps-Universität Marburg. Die Fachstudienberatung wird in der Regel durch die Professorinnen und Professoren oder beauftragte Personen wahrgenommen.",
      "token_count": 492,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          5
        ],
        "chunk_index": 4,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0003",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0005"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0005",
      "text": "Neben den allgemeinen Zugangsvoraussetzungen kann die Teilnahme an einzelnen Modulen von spezifischen Modulvoraussetzungen abhängig gemacht werden, die in der Modulliste (Anlage 2) unter 'Voraussetzungen für die Teilnahme' aufgeführt sind. Die allgemeine Studienberatung erfolgt durch die Zentrale Allgemeine Studienberatung der Philipps-Universität Marburg. Die Fachstudienberatung wird in der Regel durch die Professorinnen und Professoren oder beauftragte Personen wahrgenommen. Der Masterstudiengang 'Computer Science' ist in verschiedene Studienbereiche gegliedert, darunter die Compulsory Elective Modules in Computer Science, Profile Area Modules, Practical and Seminar Modules sowie das Final Module. Der Studiengang besteht aus Modulen, die den verschiedenen Studienbereichen zugeordnet sind. Diese Zuordnungen, der Grad ihrer Verbindlichkeit und der studentische Arbeitsaufwand in Leistungspunkten ergeben den Studienaufbau. Die Compulsory Elective Modules in Computer Science umfassen Module wie Advanced Algorithmics, Advanced Data Structures, Advanced Methods of System Development und viele weitere. Diese Module sind Wahlpflichtmodule mit unterschiedlichen Prüfungsformen und Leistungspunkten, zum Beispiel hat das Modul 'Advanced Algorithmics' 9 Leistungspunkte und wird als theoretische Prüfung abgelegt. Die Seite listet verschiedene Wahlpflichtmodule im Bereich der Informatik auf, die jeweils mit 6 Leistungspunkten bewertet sind. Dazu gehören unter anderem 'Natural Language Systems', 'Neural Networks', 'Operating Systems' und 'Parameterized Algorithms'. Es gibt auch spezialisierte Module wie 'Small Specialization Module Computer Science 1' bis '5'. Importmodule mit Bezug zur Informatik können zwischen 0 und 66 Leistungspunkten umfassen. Im Bereich der Profilmodule können 12 Leistungspunkte durch Importmodule aus anderen Disziplinen erworben werden.",
      "token_count": 465,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          5,
          6,
          7
        ],
        "chunk_index": 5,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0004",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0006"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0006",
      "text": "Dazu gehören unter anderem 'Natural Language Systems', 'Neural Networks', 'Operating Systems' und 'Parameterized Algorithms'. Es gibt auch spezialisierte Module wie 'Small Specialization Module Computer Science 1' bis '5'. Importmodule mit Bezug zur Informatik können zwischen 0 und 66 Leistungspunkten umfassen. Im Bereich der Profilmodule können 12 Leistungspunkte durch Importmodule aus anderen Disziplinen erworben werden. Praktische und Seminar-Module umfassen 24 bis 27 Leistungspunkte, darunter 'Further Selected Advanced Topics in Computer Science (Seminar)' mit 3 Leistungspunkten und 'Independent Scientific Practice Computer Science' mit 9 Leistungspunkten. Das Abschlussmodul, die Masterarbeit, umfasst 30 Leistungspunkte. Insgesamt müssen 120 Leistungspunkte erreicht werden. Im Studienbereich der Wahlpflichtmodule vertiefen die Studierenden ihre Kenntnisse in verschiedenen Disziplinen der Informatik, um spezialisiertes Wissen zu erwerben. Im optionalen Studienbereich Profile Area Modules erwerben die Studierenden Kenntnisse in einem weiteren Fach, in dem Denkweisen und Methoden der Informatik angewandt werden können. Die Liste der Fächer, aus denen Module gewählt werden können, ist in Anlage 3 oder auf der Webseite zu finden. Im Studienbereich Practical and Seminar Modules vertiefen die Studierenden ihre praxisorientierten wissenschaftlichen Fähigkeiten. Es wird die Fähigkeit zur Durchführung von Forschungsprojekten in Gruppenarbeit geübt. Studierende erlernen, Forschungsergebnisse zu vergleichen und zu beurteilen. Im Modul Independent Scientific Practice Computer Science werden Techniken des wissenschaftlichen Arbeitens in der Informatik vermittelt. Der Studiengang ist forschungsorientiert. Die Abfolge des Studiums ist im Studienverlaufsplan dargestellt. Allgemeine Informationen sind auf der Webseite der Universität verfügbar. Die Zuordnung der Veranstaltungen zu den Modulen ist im Vorlesungsverzeichnis ersichtlich.",
      "token_count": 495,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          7,
          8
        ],
        "chunk_index": 6,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0005",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0007"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0007",
      "text": "Studierende erlernen, Forschungsergebnisse zu vergleichen und zu beurteilen. Im Modul Independent Scientific Practice Computer Science werden Techniken des wissenschaftlichen Arbeitens in der Informatik vermittelt. Der Studiengang ist forschungsorientiert. Die Abfolge des Studiums ist im Studienverlaufsplan dargestellt. Allgemeine Informationen sind auf der Webseite der Universität verfügbar. Die Zuordnung der Veranstaltungen zu den Modulen ist im Vorlesungsverzeichnis ersichtlich. Der Masterstudiengang 'Computer Science' entspricht der Strukturvariante eines 'Ein-Fach-Studiengangs'. Die Regelungen zu Modulen und Leistungspunkten sind in den Allgemeinen Bestimmungen festgelegt. Der Lehrangebot wird modular angeboten, wobei jedes Modul in einer Studien- und Prüfungsordnung geregelt ist. Module werden als Pflicht- und Wahlpflichtmodule bezeichnet. Pflichtmodule müssen angeboten werden, wenn genügend Plätze vorhanden sind. Module werden zusätzlich als Basismodule, Aufbaumodule, Vertiefungsmodule, Praxismodule, Profilmodule und Abschlussmodule gekennzeichnet. Der Arbeitsaufwand wird in Leistungspunkten (LP) nach dem ECTS-System dargestellt. Ein Leistungspunkt entspricht einem Arbeitsaufwand von 25 bis 30 Stunden. Der Gesamtaufwand pro Semester beträgt 30 LP. Module im Umfang von 3 LP sind zu vermeiden, außer in begründeten Ausnahmefällen. Module erstrecken sich über ein oder maximal zwei Semester. Im Rahmen des Masterstudiengangs 'Computer Science' ist ein internes Praxismodul im Studienbereich Practical and Seminar Modules gemäß § 6 dieser Studien- und Prüfungsordnung vorgesehen. Ein externes Praxismodul ist nicht vorgesehen. Die Regelungen des § 11 Allgemeine Bestimmungen gelten ebenfalls. Für Module oder Veranstaltungen ist eine verbindliche Anmeldung erforderlich, wie im Modulhandbuch angegeben. Das An- und Abmeldeverfahren wird auf der studiengangbezogenen Webseite bekannt gegeben.",
      "token_count": 507,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          8,
          9,
          10
        ],
        "chunk_index": 7,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0006",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0008"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0008",
      "text": "Im Rahmen des Masterstudiengangs 'Computer Science' ist ein internes Praxismodul im Studienbereich Practical and Seminar Modules gemäß § 6 dieser Studien- und Prüfungsordnung vorgesehen. Ein externes Praxismodul ist nicht vorgesehen. Die Regelungen des § 11 Allgemeine Bestimmungen gelten ebenfalls. Für Module oder Veranstaltungen ist eine verbindliche Anmeldung erforderlich, wie im Modulhandbuch angegeben. Das An- und Abmeldeverfahren wird auf der studiengangbezogenen Webseite bekannt gegeben. Die Vergabe von Modul- oder Veranstaltungsplätzen erfolgt bei beschränkten Kapazitäten gemäß § 13 dieser Studien- und Prüfungsordnung. Der Zugang zu Wahlpflichtmodulen oder Lehrveranstaltungen mit begrenzten Teilnahmeplätzen wird durch festgelegte Zulassungszahlen geregelt, die vom Fachbereichsratsbeschluss bestimmt werden. Diese Zahlen sind notwendig, um einen geordneten Lehr- und Studienbetrieb zu gewährleisten. Die festgelegte Teilnehmerzahl wird rechtzeitig vor Beginn des Moduls oder der Veranstaltung bekannt gegeben. Bei Modulen oder Veranstaltungen mit begrenzter Kapazität besteht kein Anspruch auf Teilnahme, wenn das Studium alternativ andere Module oder Veranstaltungen offenlässt. Wenn die Anmeldungen die verfügbaren Plätze übersteigen, wird die Auswahl durch Los getroffen. Dabei werden Härtefälle und Studierende mit besonderem Interesse an der Teilnahme bevorzugt berücksichtigt. Ein besonderes Interesse liegt vor, wenn das Modul für die Spezialisierung verpflichtend ist, im vorherigen Semester kein Platz verfügbar war oder die Teilnahme für die Wiederholungsprüfung zwingend ist. Wenn die Plätze nicht ausreichen, entscheidet das Los. Module, die als Importmodule aus anderen Studiengängen angeboten werden, sind in Anlage 3 zusammengefasst.",
      "token_count": 476,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          10,
          11
        ],
        "chunk_index": 8,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0007",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0009"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0009",
      "text": "Dabei werden Härtefälle und Studierende mit besonderem Interesse an der Teilnahme bevorzugt berücksichtigt. Ein besonderes Interesse liegt vor, wenn das Modul für die Spezialisierung verpflichtend ist, im vorherigen Semester kein Platz verfügbar war oder die Teilnahme für die Wiederholungsprüfung zwingend ist. Wenn die Plätze nicht ausreichen, entscheidet das Los. Module, die als Importmodule aus anderen Studiengängen angeboten werden, sind in Anlage 3 zusammengefasst. Diese Module können auch im Rahmen anderer Studiengänge absolviert werden, unterliegen jedoch den Regelungen von § 20 Abs. 4 dieser Ordnung. In § 15 werden die Studienleistungen und die Anwesenheitspflicht behandelt. Studienleistungen sind im Gegensatz zu Prüfungsleistungen dadurch gekennzeichnet, dass für sie keine Leistungspunkte vergeben werden. Sie bleiben unbenotet und können Voraussetzung für die Zulassung zur Modulprüfung sein. Die Anwesenheit in Lehrveranstaltungen gilt nicht als Studienleistung, sondern wird ausschließlich die physische Präsenz überprüft. Eine Anwesenheitspflicht ist nur dann formuliert, wenn sie für den mit dem Modul verknüpften Kenntnis- und Kompetenzerwerb zwingend erforderlich ist. Der Lernerfolg der Lehrveranstaltung muss auf der Teilnahme der Studierenden beruhen. Bei einer Anwesenheitspflicht beträgt die maximal zulässige Fehlzeit 20 %. In § 16 wird der Prüfungsausschuss beschrieben. Der Fachbereich bestellt den Prüfungsausschuss, der aus vier Angehörigen der Gruppe der Professorinnen und Professoren, einem Mitglied der Gruppe der wissenschaftlichen Mitarbeiterinnen und Mitarbeiter sowie zwei Mitgliedern der Gruppe der Studierenden besteht. Ein stellvertretendes Mitglied wird gewählt. Die Amtszeit, der Vorsitz und die Beschlussfähigkeit werden in den Allgemeinen Bestimmungen geregelt.",
      "token_count": 499,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          11,
          12
        ],
        "chunk_index": 9,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0008",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0010"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0010",
      "text": "Der Fachbereich bestellt den Prüfungsausschuss, der aus vier Angehörigen der Gruppe der Professorinnen und Professoren, einem Mitglied der Gruppe der wissenschaftlichen Mitarbeiterinnen und Mitarbeiter sowie zwei Mitgliedern der Gruppe der Studierenden besteht. Ein stellvertretendes Mitglied wird gewählt. Die Amtszeit, der Vorsitz und die Beschlussfähigkeit werden in den Allgemeinen Bestimmungen geregelt. Für jeden Studiengang ist ein Prüfungsausschuss zuständig, der vom Fachbereichsrat bestellt wird. Es ist möglich, für mehrere Studiengänge einen gemeinsamen Ausschuss zu bilden. Wenn ein Studiengang von mehreren Fachbereichen angeboten wird, ist in der Regel ein gemeinsamer Prüfungsausschuss vorgesehen. Jeder Prüfungsausschuss besteht aus mindestens fünf Mitgliedern, darunter drei Mitglieder der Gruppe der Professorinnen und Professoren, ein Mitglied der Gruppe der wissenschaftlichen Mitarbeiter und ein Studierender. Bei größeren Ausschüssen sollen alle Gruppen beteiligt werden, wobei die Professoren die Mehrheit bilden. Die Amtszeit der nichtstudentischen Mitglieder beträgt zwei Jahre, die der studentischen Mitglieder ein Jahr. Eine Wiederwahl ist möglich. Die Mitglieder und stellvertretenden Mitglieder werden auf Vorschlag ihrer jeweiligen Gruppenvertreterinnen und Gruppenvertreter vom Fachbereichsrat gewählt. Der Vorsitzende und sein Stellvertreter werden aus der Mitte des Ausschusses gewählt. Der Ausschuss ist beschlussfähig, wenn mindestens die Hälfte der Mitglieder anwesend ist. Entscheidungen werden mit der Mehrheit der Stimmen der Anwesenden getroffen. Bei Stimmengleichheit entscheidet die Stimme des Vorsitzenden. In Prüfungsangelegenheiten sind geheime Abstimmungen nicht zulässig. Mitglieder des Ausschusses, die persönlich betroffen sind, sind von der Beratung und Beschlussfassung ausgeschlossen.",
      "token_count": 489,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          12,
          13
        ],
        "chunk_index": 10,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0009",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0011"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0011",
      "text": "Der Ausschuss ist beschlussfähig, wenn mindestens die Hälfte der Mitglieder anwesend ist. Entscheidungen werden mit der Mehrheit der Stimmen der Anwesenden getroffen. Bei Stimmengleichheit entscheidet die Stimme des Vorsitzenden. In Prüfungsangelegenheiten sind geheime Abstimmungen nicht zulässig. Mitglieder des Ausschusses, die persönlich betroffen sind, sind von der Beratung und Beschlussfassung ausgeschlossen. Mitglieder haben das Recht, bei mündlichen Prüfungen anwesend zu sein, jedoch nicht bei der Beratung und Bekanntgabe der Note. Die Mitglieder unterliegen der Amtsverschwiegenheit. Der Prüfungsausschuss trägt die Verantwortung für die Einhaltung der Bestimmungen der Studien- und Prüfungsordnung. Zu seinen Aufgaben gehören die Organisation des Prüfungsverfahrens, die Bestellung der Prüfer und die Entscheidung über Prüfungszulassungen. Er kann Aufgaben an den Vorsitzenden oder andere delegieren. Der Ausschuss überwacht die Prüfungsverwaltung und gibt Anregungen zur Reform der Prüfungsordnungen. Gemäß § 18 dürfen Prüferinnen und Prüfer nur Professoren oder andere nach § 22 Abs. 2 HessHG prüfungsberechtigte Personen sein. Beisitzerinnen und Beisitzer müssen mindestens eine entsprechende Abschlussprüfung oder eine vergleichbare Prüfung abgelegt haben. Bei schriftlichen Prüfungen besteht die Prüfungskommission in der Regel aus einer Prüferin oder einem Prüfer. Die schriftliche Abschlussarbeit und schriftliche Prüfungen, die nicht mehr wiederholt werden können und die ggf. zum Verlust des Prüfungsanspruchs führen, sind von zwei Prüferinnen bzw. Prüfern zu bewerten.",
      "token_count": 454,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          13,
          14
        ],
        "chunk_index": 11,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0010",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0012"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0012",
      "text": "Beisitzerinnen und Beisitzer müssen mindestens eine entsprechende Abschlussprüfung oder eine vergleichbare Prüfung abgelegt haben. Bei schriftlichen Prüfungen besteht die Prüfungskommission in der Regel aus einer Prüferin oder einem Prüfer. Die schriftliche Abschlussarbeit und schriftliche Prüfungen, die nicht mehr wiederholt werden können und die ggf. zum Verlust des Prüfungsanspruchs führen, sind von zwei Prüferinnen bzw. Prüfern zu bewerten. Mündliche Prüfungen sind entweder von mehreren Prüferinnen bzw. Prüfern oder von einer Prüferin oder einem Prüfer in Gegenwart einer sachkundigen Beisitzerin oder eines sachkundigen Beisitzers abzunehmen. Es ist ein Protokoll zu führen. Die Beisitzerin bzw. der Beisitzer ist vor Festlegung der Bewertung zu hören. Die Prüferinnen und Prüfer sowie die Beisitzerinnen und Beisitzer unterliegen der Amtsverschwiegenheit. Sie sind von der oder dem Vorsitzenden des Prüfungsausschusses zur Verschwiegenheit zu verpflichten, sofern sie nicht im öffentlichen Dienst stehen. Gemäß § 19 werden an einer Hochschule oder staatlich anerkannten Berufsakademie erbrachte Studienleistungen und Prüfungsleistungen grundsätzlich anerkannt, wenn kein wesentlicher Unterschied besteht. Wesentliche Unterschiede liegen insbesondere dann vor, wenn sich Studien- und Prüfungsleistungen in Qualifikationsziel, Umfang und Anforderungen wesentlich von dem betroffenen Studiengang an der Philipps-Universität Marburg unterscheiden. Für die Anerkennung ist ein Beweislastumkehr vorgesehen. Der Antragsteller ist verpflichtet, Informationen zur Verfügung zu stellen. Außerhalb von Hochschulen erworbene Kenntnisse können anerkannt werden, wenn sie gleichwertig sind und die Kriterien für die Anrechnung im Rahmen der Akkreditierung überprüft wurden.",
      "token_count": 496,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          14
        ],
        "chunk_index": 12,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0011",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0013"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0013",
      "text": "Wesentliche Unterschiede liegen insbesondere dann vor, wenn sich Studien- und Prüfungsleistungen in Qualifikationsziel, Umfang und Anforderungen wesentlich von dem betroffenen Studiengang an der Philipps-Universität Marburg unterscheiden. Für die Anerkennung ist ein Beweislastumkehr vorgesehen. Der Antragsteller ist verpflichtet, Informationen zur Verfügung zu stellen. Außerhalb von Hochschulen erworbene Kenntnisse können anerkannt werden, wenn sie gleichwertig sind und die Kriterien für die Anrechnung im Rahmen der Akkreditierung überprüft wurden. Studien- und Prüfungsleistungen werden anerkannt, indem die Noten übernommen und gemäß § 28 in die Berechnung der Gesamtnote einbezogen werden. Anerkannte Leistungen werden im Zeugnis als 'anerkannt' gekennzeichnet. Die Anerkennung von Leistungen dritter Zuständigkeit trifft der Prüfungsausschuss. Entscheidungen über die Anerkennung von Leistungen sind dem Antragsteller schriftlich mitzuteilen. Prüfungsleistungen in Studiengängen werden anerkannt, sofern sie im Fall ihres Bestehens anerkannt worden wären. Die Module, die im Rahmen des Studiengangs zu absolvieren sind, werden in der Modulliste (Anlage 2) sowie in der Liste mit den Importmodulen (Anlage 3) zusammengefasst. Die Art der Module, ihre Zuordnung zu verschiedenen Bereichen des Studiengangs, Wahlmöglichkeiten zwischen Modulen und innerhalb von Modulen, die Voraussetzungen für die Teilnahme an den Modulen sowie die zu erwerbenden Leistungspunkte, die Prüfungsform, die Bewertung und die Kompetenzziele ergeben sich aus diesen Listen sowie aus § 6. Bei Importmodulen ergeben sich diese Informationen aus den Originalmodullisten des anbietenden Studiengangs.",
      "token_count": 474,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          14,
          15
        ],
        "chunk_index": 13,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0012",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0014"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0014",
      "text": "Die Art der Module, ihre Zuordnung zu verschiedenen Bereichen des Studiengangs, Wahlmöglichkeiten zwischen Modulen und innerhalb von Modulen, die Voraussetzungen für die Teilnahme an den Modulen sowie die zu erwerbenden Leistungspunkte, die Prüfungsform, die Bewertung und die Kompetenzziele ergeben sich aus diesen Listen sowie aus § 6. Bei Importmodulen ergeben sich diese Informationen aus den Originalmodullisten des anbietenden Studiengangs. Das Angebot der Importmodule steht unter dem Vorbehalt, dass Änderungen der Module durch die anbietenden Lehreinheiten vorgenommen werden können, insbesondere durch Akkreditierungen. Hierzu ist keine Änderung dieser Studien- und Prüfungsordnung notwendig. Derartige Änderungen werden vom Prüfungsausschuss rechtzeitig auf der studiengangbezogenen Webseite bekannt gegeben. Außerdem kann der Prüfungsausschuss beschließen, dass generell oder im Einzelfall auf begründeten Antrag weitere Module als Importmodule zugelassen werden, sofern der anbietende Fachbereich bzw. die anbietende Einrichtung dem zustimmt. Weitergehende Informationen mit ausführlichen Modulbeschreibungen sowie das aktuelle Angebot der Importmodule werden in einem Modulhandbuch auf der Webseite des Studiengangs veröffentlicht. Die Exportmodule sind in Anlage 4 zusammengefasst. Prüfungen dürfen in der Regel nur von zum Zeitpunkt der Prüfung eingeschriebenen ordentlichen Studierenden der Philipps-Universität Marburg abgelegt werden, die den Prüfungsanspruch nicht verloren haben.",
      "token_count": 391,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          15
        ],
        "chunk_index": 14,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0013",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0015"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0015",
      "text": "Weitergehende Informationen mit ausführlichen Modulbeschreibungen sowie das aktuelle Angebot der Importmodule werden in einem Modulhandbuch auf der Webseite des Studiengangs veröffentlicht. Die Exportmodule sind in Anlage 4 zusammengefasst. Prüfungen dürfen in der Regel nur von zum Zeitpunkt der Prüfung eingeschriebenen ordentlichen Studierenden der Philipps-Universität Marburg abgelegt werden, die den Prüfungsanspruch nicht verloren haben. Das Modul, in dessen Rahmen die betreffende Leistung erbracht wird, muss entweder dem durch die Studien- und Prüfungsordnung geregelten Studiengang oder als Importmodul gemäß § 14 Abs. 1 bis 3 einem anderen Studiengang zugeordnet sein oder von einem Fachbereich oder einer wissenschaftlichen Einrichtung der Philipps-Universität Marburg nach den Regelungen dieser Ordnung angeboten werden oder, wenn es sich um ein Modul einer anderen Hochschule handelt, im Rahmen einer hochschulischen Kooperation vertraglich dem Studiengang zugeordnet sein. Modulprüfungen werden studienbegleitend erbracht. Mit ihnen wird das jeweilige Modul abgeschlossen. Durch die Modulprüfung soll die Kandidatin oder der Kandidat nachweisen, dass sie oder er die in der Modulliste definierten Qualifikationsziele erreicht hat. Module schließen in der Regel mit einer einzigen Modulprüfung ab. Sofern die Studien- und Prüfungsordnung einen Notenausgleich zwischen den Modulteilen zulässt, zählen im Falle der Wiederholung nicht bestandener Modulprüfungen die zuletzt erzielten Bewertungen. Die Wiederholung einer Modulteilprüfung ist nicht zulässig, wenn diese bereits bestanden wurde oder durch einen anderen Modulteile ausgeglichen werden konnte und damit das Modul bestanden ist.",
      "token_count": 450,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          15
        ],
        "chunk_index": 15,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0014",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0016"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0016",
      "text": "Sofern die Studien- und Prüfungsordnung einen Notenausgleich zwischen den Modulteilen zulässt, zählen im Falle der Wiederholung nicht bestandener Modulprüfungen die zuletzt erzielten Bewertungen. Die Wiederholung einer Modulteilprüfung ist nicht zulässig, wenn diese bereits bestanden wurde oder durch einen anderen Modulteile ausgeglichen werden konnte und damit das Modul bestanden ist. Die Studien- und Prüfungsordnung kann im Falle des Notenausgleichs vorsehen, dass bestimmte Teilprüfungen bestanden sein müssen oder keine Teilprüfung mit 0 Punkten gemäß § 28 Abs. 2 bewertet sein darf, damit das Modul bestanden ist. In der Modulliste ist die jeweilige Gewichtung der Modulteilprüfungen zur Gesamtnote des Moduls, ausgedrückt in Leistungspunkten, anzugeben. Pro Semester sollen gemäß Studienverlaufsplan nicht mehr als insgesamt sechs Modulprüfungen bzw. Modulteilprüfungen vorgesehen werden. Die Modulprüfungen und ggf. Modulteilprüfungen finden in mündlicher, schriftlicher oder weiterer Form gemäß § 22 statt. Die Form und Dauer der Modulprüfungen und ggf. Modulteilprüfungen der einzelnen Module sind in der Modulliste (Anlage 3) zu regeln. Die Prüfungsform ist festzulegen. Dabei können bis zu drei Prüfungsformen vorgesehen werden. § 22 beschreibt die Prüfungsformen und -dauern sowie die Bearbeitungszeiten und Umfänge. Schriftliche Prüfungen können in Form von Klausuren, die auch als E-Klausuren durchgeführt werden können, oder als Multiple-Choice-Verfahren erfolgen. Weitere Formen sind schriftliche Ausarbeitungen oder die Masterarbeit. Mündliche Prüfungen werden als Einzelprüfungen oder Disputationen durchgeführt. Weitere Prüfungsformen umfassen Seminarvorträge und Softwareerstellungen.",
      "token_count": 491,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          15,
          16
        ],
        "chunk_index": 16,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0015",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0017"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0017",
      "text": "§ 22 beschreibt die Prüfungsformen und -dauern sowie die Bearbeitungszeiten und Umfänge. Schriftliche Prüfungen können in Form von Klausuren, die auch als E-Klausuren durchgeführt werden können, oder als Multiple-Choice-Verfahren erfolgen. Weitere Formen sind schriftliche Ausarbeitungen oder die Masterarbeit. Mündliche Prüfungen werden als Einzelprüfungen oder Disputationen durchgeführt. Weitere Prüfungsformen umfassen Seminarvorträge und Softwareerstellungen. Die Prüfungsdauer für Klausuren beträgt 60 bis 120 Minuten, während mündliche Einzelprüfungen 20 bis 30 Minuten dauern. Schriftliche Ausarbeitungen umfassen in der Regel 10 bis 20 Seiten mit etwa zwei Wochen Bearbeitungszeit. Seminarvorträge finden im Rahmen einer Modulveranstaltung statt und dauern maximal 90 Minuten. Die Bearbeitungszeit für Softwareerstellungen ist studienbegleitend und umfasst etwa acht Wochen. Der Umfang der Masterarbeit beträgt in der Regel 30 bis 90 Seiten, und die Disputation dauert maximal 60 Minuten. Für die Importmodule gemäß Anlage 3 oder darin vorgesehene Prüfungen gelten die entsprechenden Regelungen der Studien- und Prüfungsordnungen der Studiengänge, aus denen die Module importiert werden, in ihrer jeweils aktuell gültigen Fassung. Multimedial gestützte schriftliche Prüfungen, sogenannte E-Klausuren, finden gemäß den Regelungen in den Allgemeinen Bestimmungen, Anlage 6, statt. Prüfungen im Multiple-Choice-Verfahren finden gemäß den Regelungen in den Allgemeinen Bestimmungen, Anlage 8, statt. Im Übrigen gelten die Regelungen des § 22 Allgemeine Bestimmungen. In § 22 wird festgelegt, dass die Form der Prüfungen geeignet sein muss, den Erwerb der jeweils vorgesehenen Kompetenzen festzustellen.",
      "token_count": 481,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          16,
          17
        ],
        "chunk_index": 17,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0016",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0018"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0018",
      "text": "Multimedial gestützte schriftliche Prüfungen, sogenannte E-Klausuren, finden gemäß den Regelungen in den Allgemeinen Bestimmungen, Anlage 6, statt. Prüfungen im Multiple-Choice-Verfahren finden gemäß den Regelungen in den Allgemeinen Bestimmungen, Anlage 8, statt. Im Übrigen gelten die Regelungen des § 22 Allgemeine Bestimmungen. In § 22 wird festgelegt, dass die Form der Prüfungen geeignet sein muss, den Erwerb der jeweils vorgesehenen Kompetenzen festzustellen. Prüfungen werden in schriftlicher Form, wie Klausuren und Hausarbeiten, oder in mündlicher Form, wie Einzel- oder Gruppenprüfungen, durchgeführt. Weitere Prüfungsformen können Seminarvorträge oder Präsentationen sein. Die Studien- und Prüfungsordnung soll vorsehen, dass Studierende im Studienverlauf Module mit unterschiedlichen Prüfungsformen absolvieren. Die Bearbeitungszeit für schriftliche Prüfungsarbeiten variiert je nach Prüfungsform. Multimedial gestützte schriftliche Prüfungen und Multiple-Choice-Verfahren unterliegen speziellen Bestimmungen. Mündliche Prüfungen können als elektronische Fernprüfungen durchgeführt werden. Die Masterarbeit ist ein obligatorischer Bestandteil des Studiengangs und wird zusammen mit einer Disputation als Abschlussmodul in deutscher oder englischer Sprache angefertigt. Sie soll die Fähigkeit nachweisen, ein abgegrenztes Problem aus dem Bereich der Informatik mit wissenschaftlichen Methoden selbstständig zu bearbeiten. Der Umfang der Masterarbeit beträgt 27 Leistungspunkte, und die Disputation umfasst zusätzlich 3 Leistungspunkte. Die Masterarbeit ist als Einzelarbeit anzufertigen. Die Zulassung zur Masterarbeit setzt voraus, dass in den Modulen des Masterstudiengangs mindestens 66 Leistungspunkte erworben wurden.",
      "token_count": 486,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          17,
          18
        ],
        "chunk_index": 18,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0017",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0019"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0019",
      "text": "Sie soll die Fähigkeit nachweisen, ein abgegrenztes Problem aus dem Bereich der Informatik mit wissenschaftlichen Methoden selbstständig zu bearbeiten. Der Umfang der Masterarbeit beträgt 27 Leistungspunkte, und die Disputation umfasst zusätzlich 3 Leistungspunkte. Die Masterarbeit ist als Einzelarbeit anzufertigen. Die Zulassung zur Masterarbeit setzt voraus, dass in den Modulen des Masterstudiengangs mindestens 66 Leistungspunkte erworben wurden. Die Kandidatin oder der Kandidat schlägt eine Betreuerin oder einen Betreuer sowie eine prüfungsberechtigte Person als Erstgutachterin oder Erstgutachter für die Masterarbeit vor. Für die Zweitgutachterin oder den Zweitgutachter besteht ebenfalls Vorschlagsrecht. Die Betreuerin oder der Betreuer sowie die Gutachter können identische Personen sein. Die Vorschläge begründen keinen Anspruch. Die Erstgutachterin oder der Erstgutachter muss vom Prüfungsausschuss für die Begutachtung von Masterarbeiten bestellt werden. Das Thema der Masterarbeit wird von der Erstgutachterin oder dem Erstgutachter dem Prüfungsausschuss vorgelegt und vom Prüfungsausschuss vergeben. Findet die Kandidatin oder der Kandidat keine Betreuerin oder keinen Betreuer und keine Gutachterin oder keinen Gutachter, so bestimmt der oder die Vorsitzende des Prüfungsausschusses die Betreuerin oder den Betreuer und die Gutachterin oder den Gutachter und sorgt dafür, dass rechtzeitig ein Thema für die Masterarbeit ausgegeben wird. Die Masterarbeit muss innerhalb der Bearbeitungszeit von 6 Monaten angefertigt werden. Das Thema der Abschlussarbeit muss so beschaffen sein, dass es innerhalb dieser Frist bearbeitet werden kann. Eine Verlängerung der Bearbeitungszeit um höchstens 20% ist auf begründeten Antrag möglich; sie führt nicht zur Vergabe zusätzlicher Leistungspunkte.",
      "token_count": 501,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          17,
          18
        ],
        "chunk_index": 19,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0018",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0020"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0020",
      "text": "Findet die Kandidatin oder der Kandidat keine Betreuerin oder keinen Betreuer und keine Gutachterin oder keinen Gutachter, so bestimmt der oder die Vorsitzende des Prüfungsausschusses die Betreuerin oder den Betreuer und die Gutachterin oder den Gutachter und sorgt dafür, dass rechtzeitig ein Thema für die Masterarbeit ausgegeben wird. Die Masterarbeit muss innerhalb der Bearbeitungszeit von 6 Monaten angefertigt werden. Das Thema der Abschlussarbeit muss so beschaffen sein, dass es innerhalb dieser Frist bearbeitet werden kann. Eine Verlängerung der Bearbeitungszeit um höchstens 20% ist auf begründeten Antrag möglich; sie führt nicht zur Vergabe zusätzlicher Leistungspunkte. Die Bearbeitungszeit beginnt mit der Themenausgabe; der Ausgabezeitpunkt ist aktenkundig zu machen. Die Masterarbeit ist fristgemäß beim Prüfungsausschuss abzugeben. Bei der Abgabe hat die Kandidatin oder der Kandidat schriftlich zu versichern, dass die Arbeit selbstständig verfasst wurde. Wird die Masterarbeit nicht fristgerecht abgegeben, gilt sie als mit 'nicht ausreichend' bewertet. Die Masterarbeit ist nicht bestanden, wenn die Gesamtbewertung nicht mindestens 5 Punkte ('ausreichend') beträgt; sie kann einmal wiederholt werden. Eine Rückgabe des Themas ist nur einmal zulässig. Ein Notenausgleich für eine nicht bestandene Masterarbeit ist nicht zulässig. Die Masterarbeit ist ein obligatorischer Bestandteil jedes Masterstudiengangs und kann entweder als eigenständiges Abschlussmodul oder zusammen mit einem Kolloquium oder einer Disputation als gemeinsames Abschlussmodul durchgeführt werden. Sie ist eine Prüfungsarbeit, in der die Kandidatin oder der Kandidat die Fähigkeit nachweisen soll, ein abgegrenztes Problem aus dem Fachbereich selbstständig zu bearbeiten. Die Arbeit umfasst 30 Leistungspunkte. In der Regel ist die Masterarbeit als Einzelarbeit anzufertigen.",
      "token_count": 501,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          18,
          19
        ],
        "chunk_index": 20,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0019",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0021"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0021",
      "text": "Die Masterarbeit ist ein obligatorischer Bestandteil jedes Masterstudiengangs und kann entweder als eigenständiges Abschlussmodul oder zusammen mit einem Kolloquium oder einer Disputation als gemeinsames Abschlussmodul durchgeführt werden. Sie ist eine Prüfungsarbeit, in der die Kandidatin oder der Kandidat die Fähigkeit nachweisen soll, ein abgegrenztes Problem aus dem Fachbereich selbstständig zu bearbeiten. Die Arbeit umfasst 30 Leistungspunkte. In der Regel ist die Masterarbeit als Einzelarbeit anzufertigen. Die Studien- und Prüfungsordnung legt die Voraussetzungen für die Zulassung zur Masterarbeit fest. Die Kandidatin oder der Kandidat schlägt eine Betreuerin oder einen Betreuer vor, die oder der vom Prüfungsausschuss bestätigt werden muss. Das Thema der Masterarbeit wird vom Prüfungsausschuss genehmigt und muss innerhalb der vorgegebenen Frist bearbeitet werden. Eine Verlängerung der Bearbeitungszeit ist unter bestimmten Bedingungen möglich. Die Masterarbeit kann in einem externen Fachbereich durchgeführt werden, wenn die fachwissenschaftliche Betreuung gewährleistet ist. Die Arbeit wird von zwei Prüferinnen bzw. Prüfern bewertet. Bei einer Bewertung unter 5 Punkten wird ein weiteres Gutachten eingeholt. § 24 behandelt die Themen Prüfungstermine, Prüfungsanmeldung und Prüfungsabmeldung. Der Prüfungsausschuss gibt die Zeiträume der Prüfungen und der Wiederholungsprüfungen bekannt. Termine für Klausuren und andere Prüfungstermine, die für alle Teilnehmerinnen und Teilnehmer eines Moduls gleichermaßen gültig sind, werden ebenfalls im Vorlesungsverzeichnis bekannt gegeben. Individuell zu vereinbarende Prüfungstermine, wie zum Beispiel Referate, werden im Vorlesungsverzeichnis mit dem Hinweis 'n. V.' bekannt gegeben. Prüfungen finden im Rahmen der jeweiligen Modulveranstaltungen oder im unmittelbaren Anschluss daran statt.",
      "token_count": 503,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          19,
          20
        ],
        "chunk_index": 21,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0020",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0022"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0022",
      "text": "Termine für Klausuren und andere Prüfungstermine, die für alle Teilnehmerinnen und Teilnehmer eines Moduls gleichermaßen gültig sind, werden ebenfalls im Vorlesungsverzeichnis bekannt gegeben. Individuell zu vereinbarende Prüfungstermine, wie zum Beispiel Referate, werden im Vorlesungsverzeichnis mit dem Hinweis 'n. V.' bekannt gegeben. Prüfungen finden im Rahmen der jeweiligen Modulveranstaltungen oder im unmittelbaren Anschluss daran statt. Klausuren sollen in der Regel am selben Wochentag und zur selben Uhrzeit stattfinden, an denen eine entsprechende Modulveranstaltung stattfindet. Für die Wiederholung der Prüfungen ist der erste Wiederholungstermin so festzusetzen, dass bei erfolgreicher Teilnahme das fortlaufende Studium im folgenden Semester gewährleistet ist. Für die Teilnahme an einer Prüfung ist eine verbindliche Anmeldung erforderlich. Der Prüfungsausschuss gibt die Fristen und die Form der Anmeldung spätestens 4 Wochen vor Beginn des Anmeldezeitraums in geeigneter Weise bekannt. Bei der Anmeldung zu Prüfungen können Studierende eigenverantwortlich zwischen dem ersten Termin und dem Wiederholungstermin wählen. Eine verbindliche Prüfungsanmeldung kann ohne die Angabe von Gründen zurückgezogen werden, sofern dies innerhalb der vom Prüfungsausschuss dafür festgelegten Frist erfolgt. Gemäß § 25 gelten die Regelungen der Allgemeinen Bestimmungen für zeitliche Vorgaben zur Erbringung von Leistungen. Die Studien- und Prüfungsordnung sieht nicht vor, dass Studierende bestimmte Module oder Mindestpunktzahlen in einem festgelegten Zeitraum erbringen müssen. § 26 behandelt die Familienförderung, den Nachteilsausgleich und das informelle Teilzeitstudium. Absatz (1) beschreibt, dass bei Veranstaltungen und Prüfungen Rücksicht auf Belastungen durch Schwangerschaft, Kindererziehung oder die Betreuung pflegebedürftiger Angehöriger genommen werden muss.",
      "token_count": 507,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          20,
          21
        ],
        "chunk_index": 22,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0021",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0023"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0023",
      "text": "Die Studien- und Prüfungsordnung sieht nicht vor, dass Studierende bestimmte Module oder Mindestpunktzahlen in einem festgelegten Zeitraum erbringen müssen. § 26 behandelt die Familienförderung, den Nachteilsausgleich und das informelle Teilzeitstudium. Absatz (1) beschreibt, dass bei Veranstaltungen und Prüfungen Rücksicht auf Belastungen durch Schwangerschaft, Kindererziehung oder die Betreuung pflegebedürftiger Angehöriger genommen werden muss. Studierende müssen die Art und Schwere der Belastung mit geeigneten Unterlagen nachweisen. Absatz (2) regelt, dass bei Behinderung oder chronischer Erkrankung Prüfungsleistungen angepasst werden können, um Nachteile auszugleichen. Absatz (3) erklärt, dass das Studium als informelles Teilzeitstudium durchgeführt werden kann, wobei keine speziellen Lehrangebote bereitgestellt werden müssen. § 27 behandelt Versäumnis, Rücktritt, Täuschung und Ordnungsverstoß. Absatz (1) legt fest, dass eine Studienleistung als nicht bestanden gilt, wenn ein wichtiger Grund für das Versäumnis nicht vorliegt. Absatz (2) fordert, dass der Grund für das Versäumnis unverzüglich schriftlich angezeigt und glaubhaft gemacht werden muss, wobei bei Krankheit ein ärztliches Attest erforderlich ist. Wenn eine Kandidatin oder ein Kandidat versucht, das Ergebnis von Studien- oder Prüfungsleistungen durch Täuschung oder nicht zugelassene Hilfsmittel zu beeinflussen, gilt die betreffende Studienleistung als nicht bestanden und wird mit 'nicht ausreichend' (0 Punkte) bewertet, gemäß § 28 Abs. 2 der Allgemeinen Bestimmungen. Stört eine Kandidatin oder ein Kandidat den ordnungsgemäßen Ablauf der Erbringung einer Studienleistung oder Prüfung, kann sie oder er von der Fortsetzung ausgeschlossen werden.",
      "token_count": 494,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          21,
          22
        ],
        "chunk_index": 23,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0022",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0024"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0024",
      "text": "Wenn eine Kandidatin oder ein Kandidat versucht, das Ergebnis von Studien- oder Prüfungsleistungen durch Täuschung oder nicht zugelassene Hilfsmittel zu beeinflussen, gilt die betreffende Studienleistung als nicht bestanden und wird mit 'nicht ausreichend' (0 Punkte) bewertet, gemäß § 28 Abs. 2 der Allgemeinen Bestimmungen. Stört eine Kandidatin oder ein Kandidat den ordnungsgemäßen Ablauf der Erbringung einer Studienleistung oder Prüfung, kann sie oder er von der Fortsetzung ausgeschlossen werden. Auch in diesem Fall wird die Leistung als 'nicht ausreichend' (0 Punkte) bewertet. In schwerwiegenden Fällen kann der Prüfungsausschuss die Kandidatin oder den Kandidaten von weiteren Prüfungsleistungen ausschließen, was zum Erlöschen des Prüfungsanspruchs im Studiengang führt. Entscheidungen über solche Ausschlüsse sind unverzüglich schriftlich mitzuteilen, zu begründen und mit einer Rechtsbehelfsbelehrung zu versehen. § 28 behandelt die Leistungsbewertung und Notenbildung. Die Module 'Project Work Computer Science' und 'Independent Scientific Practice Working Computer Science' werden abweichend von § 28 Abs. 2 der Allgemeinen Bestimmungen nicht mit Punkten bewertet. Die Gesamtbewertung der Masterprüfung erfolgt in Punkten gemäß der Tabelle, die die Umrechnung von Punkten in Noten darstellt. Nicht mit Punkten bewertete Module bleiben unberücksichtigt.",
      "token_count": 394,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          22
        ],
        "chunk_index": 24,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0023",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0025"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0025",
      "text": "Die Module 'Project Work Computer Science' und 'Independent Scientific Practice Working Computer Science' werden abweichend von § 28 Abs. 2 der Allgemeinen Bestimmungen nicht mit Punkten bewertet. Die Gesamtbewertung der Masterprüfung erfolgt in Punkten gemäß der Tabelle, die die Umrechnung von Punkten in Noten darstellt. Nicht mit Punkten bewertete Module bleiben unberücksichtigt. Die Tabelle zeigt, dass 15 Punkte der Note 0,7 (sehr gut) entsprechen, 14 Punkte der Note 1,0 (sehr gut), 13 Punkte der Note 1,3 (sehr gut), 12 Punkte der Note 1,7 (gut), 11 Punkte der Note 2,0 (gut), 10 Punkte der Note 2,3 (gut), 9 Punkte der Note 2,7 (befriedigend), 8 Punkte der Note 3,0 (befriedigend), 7 Punkte der Note 3,3 (befriedigend), 6 Punkte der Note 3,7 (ausreichend), 5 Punkte der Note 4,0 (ausreichend), und 4 bis 0 Punkte der Note 5,0 (nicht ausreichend). Bewertungen für Module, die gemäß § 21 Abs. 3 mehrere Teilprüfungen umfassen, errechnen sich aus den mit Leistungspunkten gewichteten Punkten der Teilleistungen. Die bei der Mittelwertbildung ermittelten Werte werden gerundet und alle Dezimalstellen gestrichen. Lautet die erste Dezimalstelle 5 oder größer, so wird auf den nächsten ganzzahligen Punktwert aufgerundet, andernfalls abgerundet; davon ausgenommen sind Werte größer oder gleich 4,5 und kleiner 5,0, die auf 4 Punkte abgerundet werden. Eine mit Punkten bewertete Prüfung ist bestanden, wenn mindestens 5 Punkte erreicht sind. Abweichend von Abs. 2 werden externe Praxismodule mit 'bestanden' oder 'nicht bestanden' bewertet.",
      "token_count": 501,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          22,
          23
        ],
        "chunk_index": 25,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0024",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0026"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0026",
      "text": "Lautet die erste Dezimalstelle 5 oder größer, so wird auf den nächsten ganzzahligen Punktwert aufgerundet, andernfalls abgerundet; davon ausgenommen sind Werte größer oder gleich 4,5 und kleiner 5,0, die auf 4 Punkte abgerundet werden. Eine mit Punkten bewertete Prüfung ist bestanden, wenn mindestens 5 Punkte erreicht sind. Abweichend von Abs. 2 werden externe Praxismodule mit 'bestanden' oder 'nicht bestanden' bewertet. Die Studien- und Prüfungsordnung kann vorsehen, dass neben den externen Praxismodulen weitere Module nicht mit Punkten bewertet werden. Der Gesamtumfang der mit 'bestanden' oder 'nicht bestanden' bewerteten Module soll auf höchstens 20 % der im Rahmen des Studiengangs insgesamt zu erwerbenden Leistungspunkte beschränkt sein. Die Gesamtbewertung der Masterprüfung in Punkten gemäß Spalte (a) der nachfolgenden Tabelle errechnet sich aus dem nach Leistungspunkten gewichteten Mittelwert der Modulbewertungen. Nicht mit Punkten bewertete Module gemäß Abs. 5 bleiben unberücksichtigt. Der Gesamtpunktwert wird mit einer Dezimalstelle ausgewiesen, alle folgenden Dezimalstellen werden ohne Rundung gestrichen. Die Gesamtbewertung der Masterprüfung ist auch gemäß der nachfolgenden Tabelle als Dezimalnote gemäß Spalte (b) und in Worten gemäß Spalte (c) auszudrücken. Laut Notentabelle entsprechen 14,9 bis 15,0 Punkte der Note 0,7 (ausgezeichnet), 13,9 bis 14,2 Punkte der Note 1,0 (sehr gut), 11,3 bis 11,5 Punkte der Note 1,9 (gut), 9,2 bis 9,4 Punkte der Note 2,6 (befriedigend) und 5,0 bis 5,2 Punkte der Note 4,0 (ausreichend).",
      "token_count": 503,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          23
        ],
        "chunk_index": 26,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0025",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0027"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0027",
      "text": "Laut Notentabelle entsprechen 14,9 bis 15,0 Punkte der Note 0,7 (ausgezeichnet), 13,9 bis 14,2 Punkte der Note 1,0 (sehr gut), 11,3 bis 11,5 Punkte der Note 1,9 (gut), 9,2 bis 9,4 Punkte der Note 2,6 (befriedigend) und 5,0 bis 5,2 Punkte der Note 4,0 (ausreichend). Werden in einem Wahlpflichtbereich mehr Leistungspunkte erworben als vorgesehen sind, so werden diejenigen Module für die Ermittlung der Gesamtnote berücksichtigt, die zuerst abgeschlossen wurden; sofern mehrere Module im selben Semester absolviert werden, zählen die notenbesseren. Die Studien- und Prüfungsordnung kann von Satz 1 abweichende Regelungen vorsehen. Ein Freiversuch ist nicht vorgesehen. Bestandene Prüfungen können nicht wiederholt werden. Nicht bestandene Prüfungen können dreimal wiederholt werden. Der einmalige Wechsel von bis zu zwei endgültig nicht bestandenen Wahlpflichtmodulen ist zulässig. Die Regelungen in § 23 Abs. 12 Sätze 1 und 2 der Allgemeinen Bestimmungen (Masterarbeit und Disputation) sowie § 21 Abs. 3 Satz 4 der Allgemeinen Bestimmungen (ausgeglichene Modulteilprüfungen) bleiben unberührt. Der Prüfungsanspruch im Studiengang geht insbesondere endgültig verloren, wenn eine Prüfung nach Ausschöpfen aller Wiederholungsversuche nicht bestanden ist, es sei denn, es handelt sich um eine Prüfung in einem Modul gemäß § 30 Abs. 3, oder ein schwerwiegender Täuschungsfall gemäß § 27 Abs. 3 Satz 3 vorliegt.",
      "token_count": 467,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          23,
          24
        ],
        "chunk_index": 27,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0026",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0028"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0028",
      "text": "Der Prüfungsanspruch im Studiengang geht insbesondere endgültig verloren, wenn eine Prüfung nach Ausschöpfen aller Wiederholungsversuche nicht bestanden ist, es sei denn, es handelt sich um eine Prüfung in einem Modul gemäß § 30 Abs. 3, oder ein schwerwiegender Täuschungsfall gemäß § 27 Abs. 3 Satz 3 vorliegt. Über das endgültige Nichtbestehen und den damit verbundenen Verlust des Prüfungsanspruchs wird ein Bescheid erteilt, der mit einer Rechtsbehelfsbelehrung zu versehen ist. Es gelten die Regelungen des § 32 der Allgemeinen Bestimmungen zur Ungültigkeit von Prüfungsleistungen. Gemäß § 33 erhält die Kandidatin oder der Kandidat nach Bestehen der Masterprüfung ein Zeugnis, das innerhalb von vier Wochen ausgestellt wird. Dieses Zeugnis enthält die Module mit erzielten Punkten, das Thema der Abschlussarbeit und die Gesamtbewertung in Punkten. Es wird vom Vorsitzenden des Prüfungsausschusses unterzeichnet und trägt das Datum der letzten Prüfungsleistung. Bei endgültigem Nichtbestehen wird eine Bescheinigung über die abgelegten Prüfungen ausgestellt. Auf Wunsch kann eine englische Übersetzung des Zeugnisses bereitgestellt werden. § 34 beschreibt, dass gleichzeitig mit dem Zeugnis eine Urkunde über die Verleihung des akademischen Grades ausgestellt wird, die ebenfalls vom Prüfungsausschuss unterzeichnet ist. Eine englische Übersetzung der Urkunde ist auf Antrag möglich. § 35 behandelt das Diploma Supplement, das zusammen mit dem Zeugnis und der Urkunde ausgestellt wird. Es enthält eine Einstufungstabelle gemäß § 28 Abs. 8. Eine englische Übersetzung ist ebenfalls möglich. § 36 regelt den Transcript of Records und den vollständigen Leistungsnachweis.",
      "token_count": 482,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          24,
          25
        ],
        "chunk_index": 28,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0027",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0029"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0029",
      "text": "§ 34 beschreibt, dass gleichzeitig mit dem Zeugnis eine Urkunde über die Verleihung des akademischen Grades ausgestellt wird, die ebenfalls vom Prüfungsausschuss unterzeichnet ist. Eine englische Übersetzung der Urkunde ist auf Antrag möglich. § 35 behandelt das Diploma Supplement, das zusammen mit dem Zeugnis und der Urkunde ausgestellt wird. Es enthält eine Einstufungstabelle gemäß § 28 Abs. 8. Eine englische Übersetzung ist ebenfalls möglich. § 36 regelt den Transcript of Records und den vollständigen Leistungsnachweis. Auf Antrag erhält die Kandidatin oder der Kandidat eine Bescheinigung über bestandene Prüfungen in Form eines Transcripts of Records. Nach Abschluss des Studiums wird eine vollständige Bescheinigung über alle absolvierten Prüfungen ausgestellt, einschließlich Fehlversuchen und Rücktritten. In den Schlussbestimmungen wird festgelegt, dass die Einsicht in die Prüfungsunterlagen gemäß den Allgemeinen Bestimmungen erfolgt. Studierende können auf Antrag ihre Prüfungsunterlagen einsehen, einschließlich des Gutachtens der Masterarbeit. Der Prüfungsausschuss legt Ort und Zeit der Einsichtnahme fest. Die Ordnung tritt mit ihrer Veröffentlichung in den Amtlichen Mitteilungen der Philipps-Universität Marburg in Kraft. Gleichzeitig tritt die bisherige Prüfungsordnung für den Studiengang 'Informatik' mit dem Abschluss 'Master of Science (M.Sc.)' außer Kraft. Diese Studien- und Prüfungsordnung gilt für alle Studierenden, die ihr Studium ab dem Wintersemester 2023/2024 aufnehmen. Studierende, die ihr Studium vor Inkrafttreten dieser Ordnung begonnen haben, können die Masterprüfung nach der alten Prüfungsordnung ablegen, jedoch spätestens bis zum Sommersemester 2027. Der Prüfungsausschuss kann Übergangsregelungen erlassen.",
      "token_count": 481,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          25,
          26
        ],
        "chunk_index": 29,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0028",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0030"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0030",
      "text": "Diese Studien- und Prüfungsordnung gilt für alle Studierenden, die ihr Studium ab dem Wintersemester 2023/2024 aufnehmen. Studierende, die ihr Studium vor Inkrafttreten dieser Ordnung begonnen haben, können die Masterprüfung nach der alten Prüfungsordnung ablegen, jedoch spätestens bis zum Sommersemester 2027. Der Prüfungsausschuss kann Übergangsregelungen erlassen. Die zweite Änderungssatzung gilt ab dem Wintersemester 2025/2026 für alle Studierenden, die im Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)' ab dem Wintersemester 2025/26 aufgenommen werden. Abgeschlossene und laufende Modulprüfungsverfahren werden nicht berührt. Auf dieser Seite sind drei verschiedene Datumsangaben mit den zugehörigen Unterschriften von Dekanen des Fachbereichs Mathematik und Informatik der Philipps-Universität Marburg zu finden. Am 18. April 2023 hat Prof. Dr. Bernd Freisleben als Dekan unterschrieben. Am 27. März 2024 ist ebenfalls eine Unterschrift von Prof. Dr. Bernd Freisleben vorhanden. Am 8. April 2025 hat Prof. Dr. István Heckenberger als stellvertretender Dekan unterschrieben. Der exemplarische Studienverlaufsplan für den Masterstudiengang Computer Science (M.Sc.) zeigt eine mögliche Struktur des Studiums bei Beginn im Winter- oder Sommersemester. Im ersten Semester werden drei Wahlpflichtmodule in Computer Science mit jeweils 9, 9 und 6 Leistungspunkten belegt. Im zweiten Semester folgen zwei Wahlpflichtmodule mit 9 und 6 Leistungspunkten sowie ein weiteres Modul mit 6 Leistungspunkten. Zusätzlich wird ein Modul zu speziellen, fortgeschrittenen Themen in Computer Science mit 3 Leistungspunkten angeboten.",
      "token_count": 467,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          26,
          27,
          28
        ],
        "chunk_index": 30,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0029",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0031"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0031",
      "text": "Im ersten Semester werden drei Wahlpflichtmodule in Computer Science mit jeweils 9, 9 und 6 Leistungspunkten belegt. Im zweiten Semester folgen zwei Wahlpflichtmodule mit 9 und 6 Leistungspunkten sowie ein weiteres Modul mit 6 Leistungspunkten. Zusätzlich wird ein Modul zu speziellen, fortgeschrittenen Themen in Computer Science mit 3 Leistungspunkten angeboten. Im dritten Semester sind zwei Wahlpflichtmodule mit jeweils 6 Leistungspunkten vorgesehen, zusammen mit einem Modul zur Einführung in das wissenschaftliche Arbeiten in Computer Science, das 9 Leistungspunkte umfasst. Ein weiteres Modul zu speziellen, fortgeschrittenen Themen in Computer Science mit 3 Leistungspunkten wird ebenfalls angeboten. Das vierte Semester ist der Masterarbeit gewidmet, die 30 Leistungspunkte umfasst. Insgesamt werden 120 Leistungspunkte für den Abschluss benötigt. In der Modulliste für den Studiengang 'Computer Science' sind verschiedene Wahlpflichtmodule aufgeführt. Das Modul 'Advanced Algorithmics' (CS 627) ist ein Vertiefungsmodul zur theoretischen Informatik mit 9 Leistungspunkten. Die Studierenden lernen, Algorithmen für verschiedene Anwendungsprobleme zu entwerfen und die Güte von Algorithmen zu beurteilen. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden Kompetenzen in Algorithmen und Datenstrukturen empfohlen. Für die Vergabe von Leistungspunkten müssen mindestens 50 Prozent der wöchentlichen Übungsaufgaben bearbeitet und zwei Aufgaben mündlich präsentiert werden. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Advanced Data Structures' (CS 650) ist ebenfalls ein Vertiefungsmodul zur theoretischen Informatik mit 9 Leistungspunkten. Studierende lernen, fortgeschrittene Datenstrukturen zu bewerten und Methoden für deren Entwurf und Analyse anzuwenden.",
      "token_count": 497,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          28,
          29
        ],
        "chunk_index": 31,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0030",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0032"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0032",
      "text": "Für die Vergabe von Leistungspunkten müssen mindestens 50 Prozent der wöchentlichen Übungsaufgaben bearbeitet und zwei Aufgaben mündlich präsentiert werden. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Advanced Data Structures' (CS 650) ist ebenfalls ein Vertiefungsmodul zur theoretischen Informatik mit 9 Leistungspunkten. Studierende lernen, fortgeschrittene Datenstrukturen zu bewerten und Methoden für deren Entwurf und Analyse anzuwenden. Auch hier gibt es keine Teilnahmevoraussetzungen, aber ähnliche Empfehlungen wie beim vorherigen Modul. Die Leistungspunkte werden unter denselben Bedingungen wie bei 'Advanced Algorithmics' vergeben. Das Modul 'Advanced Methods of System Development' (CS 607) ist ein Vertiefungsmodul zur praktischen Informatik mit 6 Leistungspunkten. Studierende berichten über Forschungsergebnisse und wenden wissenschaftliche Arbeitsweisen an. Die Teilnahmevoraussetzungen sind ebenfalls nicht vorhanden, jedoch werden Kompetenzen in objektorientierter Programmierung empfohlen. Die Leistungspunkte werden durch das Erreichen von mindestens 50 Prozent der Übungsaufgaben und eine mündliche Präsentation vergeben. Die Prüfung erfolgt durch eine mündliche Prüfung oder Klausur. Die Seite beschreibt verschiedene Wahlpflichtmodule im Bereich der Informatik. Das Modul 'Advanced Programming Concepts' (CS 609) ist ein Vertiefungsmodul zur theoretischen Informatik mit 6 Leistungspunkten. Die Studierenden lernen grundlegende Techniken zur formalen Beschreibung von Programmiersprachen und können über aktuelle Forschungsergebnisse berichten. Es gibt keine Voraussetzungen für die Teilnahme, jedoch wird empfohlen, Kompetenzen aus den Aufbaumodulen zur Theoretischen Informatik zu erwerben.",
      "token_count": 462,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          29,
          30
        ],
        "chunk_index": 32,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0031",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0033"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0033",
      "text": "Das Modul 'Advanced Programming Concepts' (CS 609) ist ein Vertiefungsmodul zur theoretischen Informatik mit 6 Leistungspunkten. Die Studierenden lernen grundlegende Techniken zur formalen Beschreibung von Programmiersprachen und können über aktuelle Forschungsergebnisse berichten. Es gibt keine Voraussetzungen für die Teilnahme, jedoch wird empfohlen, Kompetenzen aus den Aufbaumodulen zur Theoretischen Informatik zu erwerben. Für die Vergabe der Leistungspunkte ist das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben erforderlich, gefolgt von einer mündlichen Prüfung oder Klausur. Das Modul 'Advanced Topics in Cryptography' (CS 556) ist ebenfalls ein Vertiefungsmodul zur theoretischen Informatik mit 6 Leistungspunkten. Die Studierenden vertiefen ihre Kenntnisse in kryptografischen Verfahren und können über aktuelle Forschungsfragen berichten. Auch hier gibt es keine Teilnahmevoraussetzungen, jedoch wird empfohlen, Kompetenzen aus den Modulen 'Introduction to Cryptography and its Applications' zu erwerben. Die Vergabe der Leistungspunkte erfolgt wie beim vorherigen Modul. Das Modul 'Algorithm Engineering' (CS 628) ist ein Vertiefungsmodul zur praktischen Informatik mit 9 Leistungspunkten. Die Studierenden entwickeln effiziente Algorithmen und können deren Laufzeiten und Speicherplatzbedarf abschätzen. Es gibt keine Teilnahmevoraussetzungen, jedoch wird empfohlen, Kompetenzen aus den Modulen 'Objektorientierte Programmierung' und 'Algorithmen und Datenstrukturen sowie Effiziente Algorithmen' zu erwerben. Die Leistungspunkte werden durch die Präsentation von vier Meilensteinen in der Programmierentwicklung vergeben. Das Modul 'Algorithmic Network Analysis' (CS 529) ist ein Vertiefungsmodul zur theoretischen Informatik mit 6 Leistungspunkten. Die Studierenden modellieren Netzwerke und formulieren Berechnungsprobleme.",
      "token_count": 507,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          30
        ],
        "chunk_index": 33,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0032",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0034"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0034",
      "text": "Es gibt keine Teilnahmevoraussetzungen, jedoch wird empfohlen, Kompetenzen aus den Modulen 'Objektorientierte Programmierung' und 'Algorithmen und Datenstrukturen sowie Effiziente Algorithmen' zu erwerben. Die Leistungspunkte werden durch die Präsentation von vier Meilensteinen in der Programmierentwicklung vergeben. Das Modul 'Algorithmic Network Analysis' (CS 529) ist ein Vertiefungsmodul zur theoretischen Informatik mit 6 Leistungspunkten. Die Studierenden modellieren Netzwerke und formulieren Berechnungsprobleme. Die erfolgreiche Teilnahme am Modul 'Algorithmen und Datenstrukturen' ist erforderlich. Die Vergabe der Leistungspunkte erfolgt durch das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung. Die Seite beschreibt verschiedene Wahlpflichtmodule im Bereich der praktischen Informatik. Das Modul 'Algorithms for Bioinformatics' (CS 594) umfasst 6 Leistungspunkte und ist ein Vertiefungsmodul. Die Studierenden lernen, typische Fragestellungen aus der Bioinformatik zu diskutieren, elementare Algorithmen anzuwenden und wissenschaftliche Arbeitsweisen zu nutzen. Es gibt keine speziellen Voraussetzungen für die Teilnahme, jedoch wird die Teilnahme am Modul 'Effiziente Algorithmen' empfohlen. Die Vergabe von Leistungspunkten erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben und eine mündliche Prüfung oder Klausur. Das Modul 'Artificial Intelligence' (CS 592) ist ebenfalls ein Wahlpflichtmodul mit 6 Leistungspunkten. Die Studierenden erlernen die Anwendung von KI-Methoden, die Erstellung von Inferenzsystemen und die Anwendung von maschinellem Lernen. Auch hier gibt es keine speziellen Voraussetzungen, jedoch werden Kompetenzen aus den Basismodulen zur Informatik empfohlen.",
      "token_count": 502,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          30,
          31
        ],
        "chunk_index": 34,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0033",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0035"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0035",
      "text": "Das Modul 'Artificial Intelligence' (CS 592) ist ebenfalls ein Wahlpflichtmodul mit 6 Leistungspunkten. Die Studierenden erlernen die Anwendung von KI-Methoden, die Erstellung von Inferenzsystemen und die Anwendung von maschinellem Lernen. Auch hier gibt es keine speziellen Voraussetzungen, jedoch werden Kompetenzen aus den Basismodulen zur Informatik empfohlen. Die Leistungspunkte werden ähnlich wie im vorherigen Modul vergeben. Das Modul 'Big Data Systems' (CS 673) umfasst 9 Leistungspunkte. Die Studierenden lernen, verteilte Systeme zu benennen und reaktives Programmieren zu erklären. Es gibt keine speziellen Voraussetzungen für die Teilnahme, jedoch werden bestimmte Kompetenzen empfohlen. Die Vergabe der Leistungspunkte erfolgt durch das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben. Das Modul 'Compiler Construction' (Compilerbau) ist ein Wahlpflichtmodul im Bereich der theoretischen Informatik und umfasst 9 Leistungspunkte. Die Studierenden lernen, verschiedene Aspekte von Programmiersprachen zu vergleichen, darunter Lexik, Syntax, Semantik und Pragmatik. Sie können den Aufbau von Compilern und deren Phasen beschreiben, verstehen Werkzeuge zur Compilererzeugung und können diese anwenden. Zudem erwerben sie Kenntnisse in der Codeerzeugung, der denotationalen Semantik und abstrakten Maschinen. Die Studierenden sind in der Lage, einzelne Teile eines Compilers zu programmieren und wissenschaftliche Arbeitsweisen beim Erkennen, Formulieren und Lösen von Problemen anzuwenden. Es gibt keine speziellen Voraussetzungen für die Teilnahme. Empfohlen wird jedoch, die im Modul 'Theoretische Informatik' vermittelten Kompetenzen zu erwerben.",
      "token_count": 476,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          31,
          32
        ],
        "chunk_index": 35,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0034",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0036"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0036",
      "text": "Zudem erwerben sie Kenntnisse in der Codeerzeugung, der denotationalen Semantik und abstrakten Maschinen. Die Studierenden sind in der Lage, einzelne Teile eines Compilers zu programmieren und wissenschaftliche Arbeitsweisen beim Erkennen, Formulieren und Lösen von Problemen anzuwenden. Es gibt keine speziellen Voraussetzungen für die Teilnahme. Empfohlen wird jedoch, die im Modul 'Theoretische Informatik' vermittelten Kompetenzen zu erwerben. Für die Vergabe von Leistungspunkten müssen mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben erreicht werden. Zudem ist eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben erforderlich. Die Prüfung erfolgt in Form einer Klausur oder mündlichen Prüfung (Einzelprüfung). Die Seite beschreibt verschiedene Wahlpflichtmodule im Bereich der theoretischen und praktischen Informatik. Das Modul 'Computational Complexity Theory' (CS 576) ist ein Wahlpflichtmodul zur theoretischen Informatik mit 9 Leistungspunkten. Die Studierenden lernen, Probleme hinsichtlich der Berechnungsschwierigkeit zu klassifizieren und verschiedene Maschinenmodelle zu vergleichen. Voraussetzungen für die Teilnahme sind die erfolgreiche Teilnahme am Modul Theoretische Informatik aus dem Bachelorstudiengang Informatik. Für die Vergabe von Leistungspunkten sind eine mündliche Prüfung oder Klausur erforderlich. Das Modul 'Computer-assisted Theorem Proving' (CS 523) ist ebenfalls ein Wahlpflichtmodul zur theoretischen Informatik mit 9 Leistungspunkten. Die Studierenden beherrschen die Spezifikation formaler Beweisaufgaben und können mit speziellen Logiken umgehen. Es gibt keine Teilnahmevoraussetzungen, jedoch werden bestimmte Kompetenzen empfohlen. Für die Vergabe von Leistungspunkten ist eine mündliche Prüfung oder Klausur erforderlich.",
      "token_count": 498,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          32,
          33
        ],
        "chunk_index": 36,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0035",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0037"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0037",
      "text": "Das Modul 'Computer-assisted Theorem Proving' (CS 523) ist ebenfalls ein Wahlpflichtmodul zur theoretischen Informatik mit 9 Leistungspunkten. Die Studierenden beherrschen die Spezifikation formaler Beweisaufgaben und können mit speziellen Logiken umgehen. Es gibt keine Teilnahmevoraussetzungen, jedoch werden bestimmte Kompetenzen empfohlen. Für die Vergabe von Leistungspunkten ist eine mündliche Prüfung oder Klausur erforderlich. Das Modul 'Computer Vision I' (CS 657) ist ein Wahlpflichtmodul zur praktischen Informatik mit 6 Leistungspunkten. Die Studierenden lernen grundlegende Konzepte der Computer Vision und die Anwendung von Deep Learning. Empfohlen werden Kompetenzen aus den Basismodulen zur Informatik. Für die Vergabe von Leistungspunkten ist eine mündliche Prüfung oder Klausur erforderlich. Das Modul 'Computer Vision II' (CS 658) ist ebenfalls ein Wahlpflichtmodul zur praktischen Informatik mit 6 Leistungspunkten. Die Studierenden vertiefen ihre Kenntnisse in fortgeschrittenen Konzepten der Computer Vision und Deep Learning. Auch hier werden Kompetenzen aus den Basismodulen zur Informatik empfohlen. Für die Vergabe von Leistungspunkten ist eine mündliche Prüfung oder Klausur erforderlich. Die Seite beschreibt drei Wahlpflichtmodule im Bereich der praktischen Informatik, die jeweils 6 Leistungspunkte umfassen. Das Modul 'Content-based Image and Video Analysis' vermittelt Methoden zur Analyse von Bild- und Videodaten, einschließlich der Implementierung von Software-Systemen zur Bilderkennung mit Deep Learning Bibliotheken. Es gibt keine Teilnahmevoraussetzungen, jedoch werden Programmierkenntnisse in Python und C++ sowie Grundkenntnisse in Linux empfohlen. Die Leistung wird durch eine mündliche Prüfung oder Klausur bewertet. Das Modul 'Dialog Systems' behandelt die Funktionsweise von Dialogsystemen und deren Implementierung.",
      "token_count": 498,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          33,
          34
        ],
        "chunk_index": 37,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0036",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0038"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0038",
      "text": "Das Modul 'Content-based Image and Video Analysis' vermittelt Methoden zur Analyse von Bild- und Videodaten, einschließlich der Implementierung von Software-Systemen zur Bilderkennung mit Deep Learning Bibliotheken. Es gibt keine Teilnahmevoraussetzungen, jedoch werden Programmierkenntnisse in Python und C++ sowie Grundkenntnisse in Linux empfohlen. Die Leistung wird durch eine mündliche Prüfung oder Klausur bewertet. Das Modul 'Dialog Systems' behandelt die Funktionsweise von Dialogsystemen und deren Implementierung. Auch hier gibt es keine Teilnahmevoraussetzungen, aber Kenntnisse in Maschinellem Lernen und Natural Language Processing sind hilfreich. Die Prüfung erfolgt ebenfalls durch eine Klausur oder mündliche Prüfung. Schließlich behandelt das Modul 'Distributed Systems' die Funktionsweise verteilter Systeme und deren Algorithmen. Empfohlen werden Kenntnisse in objektorientierter Programmierung und Datenstrukturen. Die Prüfungsform ist eine mündliche Prüfung oder Klausur. Die Seite beschreibt verschiedene Wahlpflichtmodule im Bereich der Informatik. Das Modul 'Ethical Hacking and Practical Cryptanalysis' umfasst 6 Leistungspunkte und ist ein Vertiefungsmodul zur praktischen Informatik. Die Studierenden lernen Techniken zum Brechen von Sicherheitssystemen und kryptografischen Verfahren kennen und setzen diese praktisch um. Es gibt keine Teilnahmevoraussetzungen, jedoch wird empfohlen, Kompetenzen aus 'Introduction to Cryptography and its Applications' zu erwerben. Die Leistungspunkte werden durch eine mündliche Prüfung oder Klausur vergeben, wobei mindestens 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben erreicht werden müssen. Das Modul 'Formal Methods in Software Engineering' hat 9 Leistungspunkte und ist ein Vertiefungsmodul zur theoretischen Informatik. Studierende lernen, Systeme und Softwareentwicklungsaktivitäten zu formalisieren und zu analysieren.",
      "token_count": 486,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          34,
          35
        ],
        "chunk_index": 38,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0037",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0039"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0039",
      "text": "Die Leistungspunkte werden durch eine mündliche Prüfung oder Klausur vergeben, wobei mindestens 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben erreicht werden müssen. Das Modul 'Formal Methods in Software Engineering' hat 9 Leistungspunkte und ist ein Vertiefungsmodul zur theoretischen Informatik. Studierende lernen, Systeme und Softwareentwicklungsaktivitäten zu formalisieren und zu analysieren. Auch hier gibt es keine Teilnahmevoraussetzungen, aber es wird empfohlen, Kompetenzen aus 'Theoretische Informatik, Logik und Softwaretechnik' zu erwerben. Die Leistungspunkte werden ebenfalls durch eine mündliche Prüfung oder Klausur vergeben. Schließlich wird das Modul 'Geo Databases' beschrieben, das 6 Leistungspunkte umfasst und ein Vertiefungsmodul zur praktischen Informatik ist. Studierende lernen, Konzepte für Geo-Anwendungen zu beschreiben und Datenmodelle für Geo-Datenbanken zu entwickeln. Empfohlen werden Kompetenzen aus 'Algorithmen und Datenstrukturen'. Die Vergabe der Leistungspunkte erfolgt durch eine mündliche Prüfung oder Klausur. Das Modul 'Image Synthesis' (CS 681) ist ein Wahlpflichtmodul im Bereich der praktischen Informatik und umfasst 9 Leistungspunkte. Die Studierenden lernen, Methoden zur Erstellung von computer-generierten Bildern zu beschreiben und anzuwenden. Sie können die Architektur aktueller Grafikkarten erklären und parallele Programmierung anwenden. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden Kompetenzen in objektorientierter Programmierung empfohlen. Für die Vergabe der Leistungspunkte müssen mindestens 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben erreicht werden, sowie eine mündliche Prüfung oder Klausur abgelegt werden. Das Modul 'Implementation of Database Systems' (CS 672) ist ebenfalls ein Wahlpflichtmodul mit 9 Leistungspunkten.",
      "token_count": 501,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          35,
          36
        ],
        "chunk_index": 39,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0038",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0040"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0040",
      "text": "Voraussetzungen für die Teilnahme gibt es keine, jedoch werden Kompetenzen in objektorientierter Programmierung empfohlen. Für die Vergabe der Leistungspunkte müssen mindestens 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben erreicht werden, sowie eine mündliche Prüfung oder Klausur abgelegt werden. Das Modul 'Implementation of Database Systems' (CS 672) ist ebenfalls ein Wahlpflichtmodul mit 9 Leistungspunkten. Die Studierenden lernen, die Leistungsfähigkeit von Datenbanksystemen zu beurteilen und Techniken zur Entwicklung effizienter Datenstrukturen einzusetzen. Es gibt keine Teilnahmevoraussetzungen, jedoch werden Kenntnisse in Datenstrukturen empfohlen. Die Leistungspunkte werden durch das Erreichen von 50 Prozent der Punkte aus den Übungsaufgaben und eine mündliche Prüfung oder Klausur vergeben. Das Modul 'Index and Storage Structures' (CS 571) ist ein Wahlpflichtmodul mit 6 Leistungspunkten. Die Studierenden lernen, Techniken zur Entwicklung externer Datenstrukturen und deren Bewertung hinsichtlich Laufzeit und Speicherplatz. Es gibt keine Teilnahmevoraussetzungen, jedoch werden Kenntnisse in Algorithmen empfohlen. Die Vergabe der Leistungspunkte erfolgt durch das Erreichen von 50 Prozent der Punkte aus den Übungsaufgaben und eine mündliche Prüfung oder Klausur. Die Seite beschreibt verschiedene Module im Bereich der Informatik, die als Wahlpflichtmodule angeboten werden. Jedes Modul hat 9 Leistungspunkte. Das Modul 'Large Specialization Module Computer Science 1' ist ein Vertiefungsmodul zur praktischen Informatik. Die Studierenden erwerben erweiterte Kenntnisse in einem Spezialgebiet der Informatik und lernen, mit Forschungsliteratur umzugehen. Sie entwickeln Fähigkeiten zur Problemlösung und Kommunikation wissenschaftlicher Inhalte. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden bestimmte Kompetenzen empfohlen.",
      "token_count": 510,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          36,
          37
        ],
        "chunk_index": 40,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0039",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0041"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0041",
      "text": "Das Modul 'Large Specialization Module Computer Science 1' ist ein Vertiefungsmodul zur praktischen Informatik. Die Studierenden erwerben erweiterte Kenntnisse in einem Spezialgebiet der Informatik und lernen, mit Forschungsliteratur umzugehen. Sie entwickeln Fähigkeiten zur Problemlösung und Kommunikation wissenschaftlicher Inhalte. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden bestimmte Kompetenzen empfohlen. Für die Vergabe der Leistungspunkte müssen mindestens 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben erreicht werden, sowie eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Large Specialization Module Computer Science 2' ist ein Vertiefungsmodul zur theoretischen Informatik mit ähnlichen Anforderungen und Zielen. Auch hier gibt es keine Teilnahmevoraussetzungen, aber empfohlene Kompetenzen. Die Leistungspunkte werden unter den gleichen Bedingungen wie im ersten Modul vergeben. Das Modul 'Large Specialization Module Computer Science 3' ist ebenfalls ein Vertiefungsmodul zur theoretischen Informatik, wobei die Studierenden erweiterte Kenntnisse in einem ausgewählten Spezialgebiet erwerben. Die Seite beschreibt verschiedene Vertiefungsmodule im Bereich Informatik. Das Modul 'Großes Vertiefungsmodul Informatik 3' ist ein Wahlpflichtmodul auf der Niveaustufe der theoretischen Informatik und umfasst 9 Leistungspunkte. Die Qualifikationsziele beinhalten die Fähigkeit, aktuelle Forschungsergebnisse zu berichten und mit Fachliteratur umzugehen. Die Studierenden sollen in der Lage sein, wissenschaftliche Arbeitsweisen anzuwenden und Lösungen zu kommunizieren.",
      "token_count": 462,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          37,
          38
        ],
        "chunk_index": 41,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0040",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0042"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0042",
      "text": "Das Modul 'Großes Vertiefungsmodul Informatik 3' ist ein Wahlpflichtmodul auf der Niveaustufe der theoretischen Informatik und umfasst 9 Leistungspunkte. Die Qualifikationsziele beinhalten die Fähigkeit, aktuelle Forschungsergebnisse zu berichten und mit Fachliteratur umzugehen. Die Studierenden sollen in der Lage sein, wissenschaftliche Arbeitsweisen anzuwenden und Lösungen zu kommunizieren. Voraussetzungen für die Teilnahme sind der Abschluss von Aufbaumodulen, während für die Vergabe von Leistungspunkten das Bearbeiten von Übungsaufgaben und eine mündliche Präsentation erforderlich sind. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Large Specialization Module Computer Science 4' ist ebenfalls ein Wahlpflichtmodul zur theoretischen Informatik mit 9 Leistungspunkten. Die Studierenden erwerben erweiterte Kenntnisse in einem ausgewählten Spezialgebiet der Informatik. Es gibt keine spezifischen Voraussetzungen für die Teilnahme, jedoch werden bestimmte Kompetenzen empfohlen. Für die Vergabe der Leistungspunkte müssen mindestens 50 Prozent der Punkte aus den Übungsaufgaben erreicht werden, und es ist eine mündliche Präsentation erforderlich. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Large Specialization Module Computer Science 5' hat ähnliche Anforderungen und Qualifikationsziele wie das vorherige Modul. Auch hier sind keine spezifischen Voraussetzungen für die Teilnahme erforderlich, jedoch werden bestimmte Kompetenzen empfohlen. Die Vergabe der Leistungspunkte erfolgt unter den gleichen Bedingungen wie bei Modul 4.\n\nDas Modul 'Model-driven Software Development' umfasst 9 Leistungspunkte und ist ein Wahlpflichtmodul zur praktischen Informatik. Die Studierenden sollen das Paradigma der modellgetriebenen Softwareentwicklung erlernen, modellieren und Anwendungssoftware modellgetrieben entwickeln können.",
      "token_count": 508,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          38,
          39
        ],
        "chunk_index": 42,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0041",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0043"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0043",
      "text": "Auch hier sind keine spezifischen Voraussetzungen für die Teilnahme erforderlich, jedoch werden bestimmte Kompetenzen empfohlen. Die Vergabe der Leistungspunkte erfolgt unter den gleichen Bedingungen wie bei Modul 4.\n\nDas Modul 'Model-driven Software Development' umfasst 9 Leistungspunkte und ist ein Wahlpflichtmodul zur praktischen Informatik. Die Studierenden sollen das Paradigma der modellgetriebenen Softwareentwicklung erlernen, modellieren und Anwendungssoftware modellgetrieben entwickeln können. Sie sollen die Kernkonzepte und Techniken erläutern und die Möglichkeiten und Grenzen diskutieren können. Empfohlen werden Kompetenzen aus den Basismodulen der Informatik. Für die Vergabe von Leistungspunkten müssen 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben erreicht und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben durchgeführt werden. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Modern Methods of System Development' (CS 507) ist ebenfalls ein Wahlpflichtmodul mit 9 Leistungspunkten. Die Studierenden sollen über neue Forschungsergebnisse berichten und wissenschaftliche Arbeitsweisen anwenden können. Empfohlen werden Kompetenzen aus den Basismodulen der objektorientierten Programmierung. Die Leistungspunkte werden unter ähnlichen Bedingungen wie im vorherigen Modul vergeben. Das Modul 'Multimedia Signal Processing' (CS 682) ist ein weiteres Wahlpflichtmodul mit 9 Leistungspunkten. Die Studierenden sollen in der Lage sein, Inhalte für moderne Kommunikationsmedien zu erstellen und vertiefte Kenntnisse über Verfahren zur digitalen Erfassung und Verarbeitung zu erlangen. Das Modul 'CS 619' ist ein Wahlpflichtmodul mit 6 Leistungspunkten. Die Studierenden sollen in der Lage sein, wissenschaftliche Inhalte zu formulieren und zu präsentieren.",
      "token_count": 488,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          38,
          39
        ],
        "chunk_index": 43,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0042",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0044"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0044",
      "text": "Das Modul 'Multimedia Signal Processing' (CS 682) ist ein weiteres Wahlpflichtmodul mit 9 Leistungspunkten. Die Studierenden sollen in der Lage sein, Inhalte für moderne Kommunikationsmedien zu erstellen und vertiefte Kenntnisse über Verfahren zur digitalen Erfassung und Verarbeitung zu erlangen. Das Modul 'CS 619' ist ein Wahlpflichtmodul mit 6 Leistungspunkten. Die Studierenden sollen in der Lage sein, wissenschaftliche Inhalte zu formulieren und zu präsentieren. Die Seite beschreibt verschiedene Module des Studiengangs 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'. Jedes Modul ist mit einer bestimmten Anzahl von Leistungspunkten (LP) versehen und hat spezifische Qualifikationsziele sowie Voraussetzungen für die Teilnahme und die Vergabe von Leistungspunkten. Das Modul 'Natural Language Systems' (Sprachsysteme) ist ein Wahlpflichtmodul zur praktischen Informatik mit 6 LP. Die Studierenden sollen grundlegende Funktionen und Komponenten von Sprachsystemen benennen und diese im Kontext verschiedener Einsatzszenarien vergleichen können. Empfohlen werden Kompetenzen aus den Modulen Künstliche Intelligenz, Maschinelles Lernen oder Introduction to Natural Language Processing. Für die Vergabe der LP müssen 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben erreicht werden, sowie eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben erfolgen. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Neural Networks' (Neuronale Netze) ist ebenfalls ein Wahlpflichtmodul zur praktischen Informatik mit 6 LP. Die Studierenden sollen Aspekte der Theorie der neuronalen Netze erklären und verschiedene Architekturen beschreiben können. Empfohlen werden Kompetenzen aus den Modulen Maschinelles Lernen und Grundlagen der Statistik.",
      "token_count": 478,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          39,
          40
        ],
        "chunk_index": 44,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0043",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0045"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0045",
      "text": "Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Neural Networks' (Neuronale Netze) ist ebenfalls ein Wahlpflichtmodul zur praktischen Informatik mit 6 LP. Die Studierenden sollen Aspekte der Theorie der neuronalen Netze erklären und verschiedene Architekturen beschreiben können. Empfohlen werden Kompetenzen aus den Modulen Maschinelles Lernen und Grundlagen der Statistik. Die Studienleistung erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Operating Systems' (Betriebssysteme) ist ein Wahlpflichtmodul zur praktischen Informatik mit 6 LP. Die Studierenden sollen die Funktionsweise von Betriebssystemen erläutern und eigenständig Betriebssystemmodule programmieren können. Empfohlen werden Kompetenzen aus den Modulen Objektorientierte Programmierung, Algorithmen und Datenstrukturen, sowie Systemsoftware und Rechnerkommunikation. Die Studienleistung erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Parameterized Algorithms' (Parametrisierte Algorithmen) ist ein Wahlpflichtmodul zur theoretischen Informatik mit 6 LP. Die Studierenden sollen für schwere Berechnungsprobleme adäquate Parametrisierungen identifizieren können. Die erfolgreiche Teilnahme am Modul 'Algorithmen und Komplexität' wird empfohlen. Die Studienleistung erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben.",
      "token_count": 503,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          40
        ],
        "chunk_index": 45,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0044",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0046"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0046",
      "text": "Die Studierenden sollen für schwere Berechnungsprobleme adäquate Parametrisierungen identifizieren können. Die erfolgreiche Teilnahme am Modul 'Algorithmen und Komplexität' wird empfohlen. Die Studienleistung erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Program Verification and Synthesis' (CS 524) ist ein Wahlpflichtmodul zur theoretischen Informatik mit 9 Leistungspunkten. Die Studierenden lernen, aktuelle Forschungswerkzeuge einzusetzen, neue Einsatzgebiete zu erkunden, theoretische Hintergründe zu erarbeiten, mit Logik umzugehen, Konzepte der Verifikation und Synthese von Software zu erläutern, sowie Anwendungen und Grenzen von Entscheidungsverfahren zu diskutieren. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden bestimmte Kompetenzen empfohlen. Die Vergabe der Leistungspunkte erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Small Specialization Module Computer Science 1' (CS 549) ist ein Wahlpflichtmodul zur praktischen Informatik mit 6 Leistungspunkten. Die Studierenden erwerben vertiefte Kenntnisse in einem ausgewählten Spezialgebiet der Informatik und können aktuelle Forschungsergebnisse berichten. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden bestimmte Kompetenzen empfohlen.",
      "token_count": 457,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          40,
          41
        ],
        "chunk_index": 46,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0045",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0047"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0047",
      "text": "Das Modul 'Small Specialization Module Computer Science 1' (CS 549) ist ein Wahlpflichtmodul zur praktischen Informatik mit 6 Leistungspunkten. Die Studierenden erwerben vertiefte Kenntnisse in einem ausgewählten Spezialgebiet der Informatik und können aktuelle Forschungsergebnisse berichten. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden bestimmte Kompetenzen empfohlen. Die Vergabe der Leistungspunkte erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben. Die Prüfung erfolgt als Klausur oder mündliche Prüfung. Das Modul 'Small Specialization Module Computer Science 2' (CS 590) ist ebenfalls ein Wahlpflichtmodul zur praktischen Informatik mit 6 Leistungspunkten. Die Studierenden erwerben vertiefte Kenntnisse in einem ausgewählten Spezialgebiet der Informatik. Voraussetzungen für die Teilnahme gibt es keine, jedoch werden bestimmte Kompetenzen empfohlen. Die Vergabe der Leistungspunkte erfordert das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben und eine mündliche Präsentation der Lösung von mindestens zwei der Übungsaufgaben. Die Prüfung erfolgt als Klausur oder mündliche Prüfung. Das Modul 'Kleines Vertiefungsmodul Informatik 2' ist ein Wahlpflichtmodul auf der Niveaustufe der praktischen Informatik und umfasst 6 Leistungspunkte. Die Qualifikationsziele beinhalten die Fähigkeit, aktuelle Forschungsergebnisse zu berichten und mit Fachliteratur umzugehen. Studierende sollen Arbeitsweisen der Informatik für ein ausgewähltes Spezialgebiet anwenden können, einschließlich der Entwicklung und Anwendung grundlegender Lösungsstrategien sowie deren formale Beschreibung.",
      "token_count": 502,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          41,
          42
        ],
        "chunk_index": 47,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0046",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0048"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0048",
      "text": "Das Modul 'Kleines Vertiefungsmodul Informatik 2' ist ein Wahlpflichtmodul auf der Niveaustufe der praktischen Informatik und umfasst 6 Leistungspunkte. Die Qualifikationsziele beinhalten die Fähigkeit, aktuelle Forschungsergebnisse zu berichten und mit Fachliteratur umzugehen. Studierende sollen Arbeitsweisen der Informatik für ein ausgewähltes Spezialgebiet anwenden können, einschließlich der Entwicklung und Anwendung grundlegender Lösungsstrategien sowie deren formale Beschreibung. Sie sollen wissenschaftliche Arbeitsweisen bei der eigenständigen Lösung von Problemen anwenden und kommunizieren können. Kompetenzen aus dem Bereich Theoretische Informatik werden vorausgesetzt. Voraussetzungen für die Teilnahme sind der Aufbau von Kompetenzen, die themenabhängig vermittelt werden. Für die Vergabe von Leistungspunkten müssen Studierende mindestens zwei Übungsaufgaben bearbeiten und präsentieren. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Small Specialization Module Computer Science 3' ist ebenfalls ein Wahlpflichtmodul mit 6 Leistungspunkten. Die Studierenden sollen vertiefte Kenntnisse in einem ausgewählten Spezialgebiet der Informatik erwerben. Die Voraussetzungen für die Teilnahme sind keine, jedoch werden bestimmte Kompetenzen empfohlen. Für die Vergabe von Leistungspunkten müssen mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben erreicht werden, einschließlich der Präsentation von mindestens zwei Aufgaben. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Small Specialization Module Computer Science 4' hat ähnliche Anforderungen und Qualifikationsziele wie das Modul 3. Auch hier sind keine Teilnahmevoraussetzungen erforderlich, jedoch werden bestimmte Kompetenzen empfohlen.",
      "token_count": 481,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          42
        ],
        "chunk_index": 48,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0047",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0049"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0049",
      "text": "Für die Vergabe von Leistungspunkten müssen mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben erreicht werden, einschließlich der Präsentation von mindestens zwei Aufgaben. Die Prüfung erfolgt durch eine Klausur oder mündliche Prüfung. Das Modul 'Small Specialization Module Computer Science 4' hat ähnliche Anforderungen und Qualifikationsziele wie das Modul 3. Auch hier sind keine Teilnahmevoraussetzungen erforderlich, jedoch werden bestimmte Kompetenzen empfohlen. Die Vergabe von Leistungspunkten erfolgt unter den gleichen Bedingungen wie bei Modul 3.\n\nDie Seite beschreibt verschiedene Module des Studiengangs 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'. Das Modul 'Small Specialization Module Computer Science 5' ist ein kleines Vertiefungsmodul in der praktischen Informatik. Die Studierenden erwerben vertiefte Kenntnisse in einem ausgewählten Spezialgebiet der Informatik und können aktuelle Forschungsergebnisse berichten. Sie sind in der Lage, wissenschaftliche Arbeitsweisen anzuwenden und Probleme eigenständig zu lösen. Empfohlen werden Kompetenzen aus den Aufbaumodulen. Für die Vergabe der Leistungspunkte müssen 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben erreicht werden, und es erfolgt eine Prüfung in Form einer Klausur oder mündlichen Prüfung. Das Modul 'Software as a Medical Device' ist ein Wahlpflichtmodul, das sich mit der Softwareentwicklung für Medizinprodukte beschäftigt. Die Studierenden lernen, Konzepte zu beschreiben und können Denk- und Arbeitsweisen der Regulierungsbehörden anwenden. Es sind keine speziellen Voraussetzungen für die Teilnahme erforderlich. Die Leistungspunkte werden durch das Erreichen von 50 Prozent der Punkte aus den Übungsaufgaben und einer mündlichen Prüfung oder Klausur vergeben.",
      "token_count": 482,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          42,
          43
        ],
        "chunk_index": 49,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0048",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0050"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0050",
      "text": "Das Modul 'Software as a Medical Device' ist ein Wahlpflichtmodul, das sich mit der Softwareentwicklung für Medizinprodukte beschäftigt. Die Studierenden lernen, Konzepte zu beschreiben und können Denk- und Arbeitsweisen der Regulierungsbehörden anwenden. Es sind keine speziellen Voraussetzungen für die Teilnahme erforderlich. Die Leistungspunkte werden durch das Erreichen von 50 Prozent der Punkte aus den Übungsaufgaben und einer mündlichen Prüfung oder Klausur vergeben. Das Modul 'Software Evolution' behandelt die systematische Einarbeitung in Softwareprojekte und die Durchführung von Evolutionsaufgaben. Empfohlen werden Kompetenzen aus den Basismodulen der Informatik. Die Leistungspunkte werden durch das Erreichen von 50 Prozent der Punkte aus den Übungsaufgaben und einer mündlichen Prüfung oder Klausur vergeben. Schließlich wird das Modul 'Statistical Bioinformatics' beschrieben, das keine speziellen Voraussetzungen für die Teilnahme hat. Die Leistungspunkte werden durch das Erreichen von 50 Prozent der Punkte aus den Übungsaufgaben vergeben. Das Modul 'Virtual Machines' (Virtuelle Maschinen) mit der Kennung CS 530 ist ein Wahlpflichtmodul auf der Vertiefungsstufe zur praktischen Informatik und umfasst 6 Leistungspunkte. Die Studierenden sollen die grundlegenden Konzepte von prozess- und systembasierten virtuellen Maschinen beschreiben und erläutern können. Sie sollen den Aufbau von virtuellen Maschinen und deren Komponenten wie Scheduler und Garbage Collection entwickeln können. Weiterhin sollen sie Methoden von System-basierten VMs wie Hypervisor und Hardware-Emulation erklären können. Optimierungen in virtuellen Maschinen und moderne Forschungsarbeiten im Bereich VM-Technologie sollen ebenfalls behandelt werden. Es gibt keine speziellen Voraussetzungen für die Teilnahme, jedoch werden Kompetenzen aus den Basismodulen der Informatik empfohlen.",
      "token_count": 487,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          43,
          44
        ],
        "chunk_index": 50,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0049",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0051"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0051",
      "text": "Sie sollen den Aufbau von virtuellen Maschinen und deren Komponenten wie Scheduler und Garbage Collection entwickeln können. Weiterhin sollen sie Methoden von System-basierten VMs wie Hypervisor und Hardware-Emulation erklären können. Optimierungen in virtuellen Maschinen und moderne Forschungsarbeiten im Bereich VM-Technologie sollen ebenfalls behandelt werden. Es gibt keine speziellen Voraussetzungen für die Teilnahme, jedoch werden Kompetenzen aus den Basismodulen der Informatik empfohlen. Für die Vergabe von Leistungspunkten ist das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben sowie eine mündliche Präsentation erforderlich. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Visual Languages' (Visuelle Sprachen) mit der Kennung CS 562 ist ebenfalls ein Wahlpflichtmodul auf der Vertiefungsstufe zur praktischen Informatik und umfasst 6 Leistungspunkte. Die Studierenden sollen Unterschiede zwischen textuellen und visuellen Sprachen erläutern und Methoden zur Definition visueller Sprachen beschreiben können. Sie sollen mit Designwerkzeugen für visuelle Sprachen umgehen und in der Lage sein, wissenschaftliche Arbeitsweisen bei Problemen anzuwenden. Es gibt keine speziellen Voraussetzungen für die Teilnahme, jedoch werden Kompetenzen aus den Basismodulen der Informatik empfohlen. Für die Vergabe von Leistungspunkten ist das Erreichen von mindestens 50 Prozent der Punkte aus den wöchentlich zu bearbeitenden Übungsaufgaben sowie eine mündliche Präsentation erforderlich. Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Web Technologies' (Web Technologien) mit der Kennung CS 533 ist ein Wahlpflichtmodul auf der Vertiefungsstufe und umfasst 6 Leistungspunkte. Die Studierenden sollen in der Lage sein, die wichtigsten Methoden aus der statistischen Bioinformatik zu erläutern und geeignete Verfahren auszuwählen und zu implementieren.",
      "token_count": 498,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          44
        ],
        "chunk_index": 51,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0050",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0052"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0052",
      "text": "Die Prüfung erfolgt mündlich oder als Klausur. Das Modul 'Web Technologies' (Web Technologien) mit der Kennung CS 533 ist ein Wahlpflichtmodul auf der Vertiefungsstufe und umfasst 6 Leistungspunkte. Die Studierenden sollen in der Lage sein, die wichtigsten Methoden aus der statistischen Bioinformatik zu erläutern und geeignete Verfahren auszuwählen und zu implementieren. Es gibt keine speziellen Voraussetzungen für die Teilnahme. Die Seite beschreibt verschiedene Module im Bereich der Informatik. Das Modul 'Webtechnologien' gehört zur praktischen Informatik und vermittelt den Studierenden die Fähigkeit, Webtechnologien zu erklären, deren Einsatzmöglichkeiten aufzuzeigen und wissenschaftliche Arbeitsweisen anzuwenden. Empfohlen werden Grundkenntnisse in Programmierung und Softwaretechnik. Für die Vergabe von Leistungspunkten müssen 50 Prozent der Punkte aus den wöchentlichen Übungsaufgaben bearbeitet werden, inklusive einer mündlichen Präsentation. Die Prüfung erfolgt mündlich oder schriftlich. Das Modul 'Further Selected Advanced Topics in Computer Science (Seminar)' ist ein Wahlpflichtmodul, bei dem Studierende lernen, selbstständig ein Spezialthema der Informatik zu erarbeiten. Vorkenntnisse sind abhängig von der fachlichen Ausrichtung des Seminars. Die Prüfung besteht aus einem Seminarvortrag und einer schriftlichen Ausarbeitung. Das Modul 'Independent Scientific Practice Computer Science' ist ein Pflichtmodul, das die Fähigkeit fördert, sich selbstständig in ein wissenschaftliches Gebiet einzuarbeiten. Empfohlen werden Kompetenzen aus den Aufbau- und Vertiefungsmodulen. Die Prüfung erfolgt durch eine schriftliche Ausarbeitung. Schließlich wird das Modul 'Project Work Computer Science' beschrieben, ein Pflichtmodul, bei dem Studierende eine umfangreiche Aufgabenstellung im Team bearbeiten. Die Prüfung umfasst die Softwareerstellung.",
      "token_count": 487,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          44,
          45
        ],
        "chunk_index": 52,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0051",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0053"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0053",
      "text": "Das Modul 'Independent Scientific Practice Computer Science' ist ein Pflichtmodul, das die Fähigkeit fördert, sich selbstständig in ein wissenschaftliches Gebiet einzuarbeiten. Empfohlen werden Kompetenzen aus den Aufbau- und Vertiefungsmodulen. Die Prüfung erfolgt durch eine schriftliche Ausarbeitung. Schließlich wird das Modul 'Project Work Computer Science' beschrieben, ein Pflichtmodul, bei dem Studierende eine umfangreiche Aufgabenstellung im Team bearbeiten. Die Prüfung umfasst die Softwareerstellung. Das Modul 'Selected Advanced Topics in Computer Science (Seminar)' mit der Modulnummer CS 610 ist ein Pflichtmodul auf Profilmodul-Niveau und umfasst 3 Leistungspunkte. Die Studierenden sollen in der Lage sein, sich selbstständig in Spezialthemen der Informatik einzuarbeiten, Zusammenhänge zu erläutern und wissenschaftliche Literatur zu nutzen. Es gibt keine Teilnahmevoraussetzungen, jedoch werden Vorkenntnisse in Informatik und Mathematik empfohlen. Die Vergabe der Leistungspunkte erfolgt durch zwei Teilprüfungen: einen Seminarvortrag mit einer Gewichtung von 1 LP und eine schriftliche Ausarbeitung mit einer Gewichtung von 2 LP. Das Modul ist unbenotet. Das 'Final Module' umfasst die Master Thesis mit der Modulnummer CS 699, die ein Pflichtmodul auf Abschlussmodul-Niveau ist und 30 Leistungspunkte umfasst. Die Studierenden sollen eine umfangreiche wissenschaftliche Arbeit selbstständig bearbeiten und die Ergebnisse schriftlich und mündlich darstellen. Voraussetzung ist der Erwerb von mindestens 66 Leistungspunkten. Die Leistungspunkte werden durch zwei Teilprüfungen vergeben: die Masterarbeit mit einer Gewichtung von 27 LP und die Disputation mit einer Gewichtung von 3 LP. In Anlage 3, der Importmodulliste, werden Studienangebote aufgeführt, die gemäß der Studien- und Prüfungsordnung gewählt werden können.",
      "token_count": 492,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          45,
          46,
          47
        ],
        "chunk_index": 53,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0052",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0054"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0054",
      "text": "Voraussetzung ist der Erwerb von mindestens 66 Leistungspunkten. Die Leistungspunkte werden durch zwei Teilprüfungen vergeben: die Masterarbeit mit einer Gewichtung von 27 LP und die Disputation mit einer Gewichtung von 3 LP. In Anlage 3, der Importmodulliste, werden Studienangebote aufgeführt, die gemäß der Studien- und Prüfungsordnung gewählt werden können. Diese Module unterliegen den Bestimmungen des § 14 Abs. 1, wobei die Details zu Qualifikationszielen, Voraussetzungen, Leistungspunkten und Prüfungsmodalitäten von der anbietenden Lehreinheit festgelegt werden. Der Katalog der wählbaren Studienangebote kann durch den Prüfungsausschuss geändert werden, insbesondere wenn sich das Angebot der Studiengänge der anbietenden Fachbereiche an der Philipps-Universität Marburg ändert. Solche Änderungen werden auf den jeweiligen Studiengangswebseiten veröffentlicht. Die Teilnahme an den genannten Studienangeboten kann von einer Studienberatung oder verbindlichen Anmeldung abhängig gemacht werden. Bei Kapazitätsbeschränkungen gelten die Regelungen der Studien- und Prüfungsordnung. Es wird keine Garantie für die Durchführung des Angebots übernommen. Auf Antrag können Studierende zusätzliche Importmodule belegen, wenn der anbietende Fachbereich zustimmt. Das aktuelle Importangebot wird auf der Webseite des modularen Fachbereichs veröffentlicht. Studierende sollten die Informations- und Beratungsangebote des Fachbereichs nutzen. Teilnahmevoraussetzungen und Kombinationsregelungen sind zu beachten. Zum Zeitpunkt der letzten Beschlussfassung wurden folgende Module vereinbart: Die nachfolgenden Module sind für Wahlpflichtmodule in der Informatik verwendbar. Das aktuelle Angebot und eventuelle Belegungsregelungen sind auf der Webseite des Studiengangs zu finden.",
      "token_count": 486,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          46,
          47
        ],
        "chunk_index": 54,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0053",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0055"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0055",
      "text": "Studierende sollten die Informations- und Beratungsangebote des Fachbereichs nutzen. Teilnahmevoraussetzungen und Kombinationsregelungen sind zu beachten. Zum Zeitpunkt der letzten Beschlussfassung wurden folgende Module vereinbart: Die nachfolgenden Module sind für Wahlpflichtmodule in der Informatik verwendbar. Das aktuelle Angebot und eventuelle Belegungsregelungen sind auf der Webseite des Studiengangs zu finden. Module der Praktischen Informatik sind mit 'P' gekennzeichnet, Module der Theoretischen Informatik mit 'T'. Die Seite listet verschiedene Module aus den Studiengängen BSc Data Science, MSc Data Science und BSc Informatik des Fachbereichs Mathematik und Informatik auf. Für den BSc Data Science gibt es die Aufbaumodule 'Effiziente Algorithmen' und 'Maschinelles Lernen', jeweils mit 9 Leistungspunkten. Im MSc Data Science werden Vertiefungsmodule wie 'Data Science in Biomedicine', 'Databionics', 'Data Integration', 'Deep Learning', 'Introduction to Natural Language Processing', 'Explainable Artificial Intelligence', 'Generative AI', 'Information Retrieval' und 'Temporal Data Mining' angeboten, die jeweils 6 oder 9 Leistungspunkte umfassen. Der BSc Informatik bietet Aufbaumodule wie 'Einführung in die Bioinformatik', 'Einführung in die Kryptographie und ihre Anwendungen', 'Entwurf und Administration von Datenbanken', 'Grafikprogrammierung', 'IT-Sicherheit', 'NoSQL Datenbanksysteme', 'Rechnernetze', 'Software Design und Programmiertechniken' und 'Softwarequalität', die jeweils 6 oder 9 Leistungspunkte haben. Es gibt auch große und kleine Aufbaumodule Informatik, die ebenfalls 6 oder 9 Leistungspunkte umfassen. Die Seite listet verschiedene Module auf, die im Bereich Mathematik und Informatik sowie Wirtschaftswissenschaften angeboten werden.",
      "token_count": 471,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          47,
          48,
          49
        ],
        "chunk_index": 55,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0054",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0056"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0056",
      "text": "Der BSc Informatik bietet Aufbaumodule wie 'Einführung in die Bioinformatik', 'Einführung in die Kryptographie und ihre Anwendungen', 'Entwurf und Administration von Datenbanken', 'Grafikprogrammierung', 'IT-Sicherheit', 'NoSQL Datenbanksysteme', 'Rechnernetze', 'Software Design und Programmiertechniken' und 'Softwarequalität', die jeweils 6 oder 9 Leistungspunkte haben. Es gibt auch große und kleine Aufbaumodule Informatik, die ebenfalls 6 oder 9 Leistungspunkte umfassen. Die Seite listet verschiedene Module auf, die im Bereich Mathematik und Informatik sowie Wirtschaftswissenschaften angeboten werden. Im Bereich Mathematik und Informatik gibt es Module wie 'Verteiltes Datenmanagement' und 'Agiles und klassisches Requirements-Engineering', die als Aufbaumodule mit 9 bzw. 6 Leistungspunkten angeboten werden. Weitere Module wie 'Applications of Artificial Intelligence in Business' und 'Cloud Computing' sind Vertiefungsmodule mit jeweils 6 Leistungspunkten. Im Bereich Wirtschaftswissenschaften werden Module wie 'Absatzwirtschaft' und 'Buchführung und Abschluss' als Basismodule mit 6 Leistungspunkten angeboten. Vertiefungsmodule wie 'Business Intelligence' und 'Controlling mit Kennzahlen' sind ebenfalls mit 6 Leistungspunkten versehen. Die Seite enthält Informationen zu Modulen, die im Bereich der Wirtschaftswissenschaften und Biologie angeboten werden. Im Bereich Wirtschaftswissenschaften, Studiengang BSc Betriebswirtschaftslehre, gibt es verschiedene Vertiefungsmodule wie 'Intermediate Finance', 'International Business Strategy' und 'Management Accounting', die jeweils 6 Leistungspunkte umfassen. Im Bereich Biologie, Studiengang BSc Biologie, werden Profilmodule wie 'Aktuelle Themen der Ökologie', 'Biochemie I' und 'Biologie der Tiere' angeboten, die ebenfalls jeweils 6 Leistungspunkte umfassen.",
      "token_count": 479,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          48,
          49,
          50
        ],
        "chunk_index": 56,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0055",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0057"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0057",
      "text": "Im Bereich Wirtschaftswissenschaften, Studiengang BSc Betriebswirtschaftslehre, gibt es verschiedene Vertiefungsmodule wie 'Intermediate Finance', 'International Business Strategy' und 'Management Accounting', die jeweils 6 Leistungspunkte umfassen. Im Bereich Biologie, Studiengang BSc Biologie, werden Profilmodule wie 'Aktuelle Themen der Ökologie', 'Biochemie I' und 'Biologie der Tiere' angeboten, die ebenfalls jeweils 6 Leistungspunkte umfassen. Studierende, die sich für den Profilbereich Biologie interessieren, sollten sich beim Fachbereich Mathematik und Informatik melden. Eine Anmeldung im Studiendekanat des Fachbereichs Biologie ist erforderlich. Weitere Informationen zu Belegungsregelungen sind online verfügbar. Die Seite listet Module für den Fachbereich Biologie auf, die im Studiengang BSc Biologie und LAA G Biologie angeboten werden. Jedes Modul ist entweder ein Profilmodul oder ein Basismodul und hat jeweils 6 Leistungspunkte. Beispiele für Profilmodule im BSc Biologie sind 'Molekularbiologie und Stoffwechsel der Prokaryonten' und 'Neuroethologie'. Im LAA G Biologie sind Basismodule wie 'Anatomie und Physiologie der Pflanzen für Lehramt an Gymnasien-Studierende' enthalten. Zusätzlich werden Module für die Profile Area Geography aufgeführt, die aus der Lehreinheit Geographie stammen. Diese Basismodule umfassen Themen wie 'Basiswissen: Bevölkerungsgeographie' und 'Basiswissen: Stadtgeographie', jeweils mit 3 Leistungspunkten. Die Seite listet Module für verschiedene Studiengänge im Fachbereich Geographie auf.",
      "token_count": 436,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          50,
          51,
          52
        ],
        "chunk_index": 57,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0056",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0058"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0058",
      "text": "Im LAA G Biologie sind Basismodule wie 'Anatomie und Physiologie der Pflanzen für Lehramt an Gymnasien-Studierende' enthalten. Zusätzlich werden Module für die Profile Area Geography aufgeführt, die aus der Lehreinheit Geographie stammen. Diese Basismodule umfassen Themen wie 'Basiswissen: Bevölkerungsgeographie' und 'Basiswissen: Stadtgeographie', jeweils mit 3 Leistungspunkten. Die Seite listet Module für verschiedene Studiengänge im Fachbereich Geographie auf. Für den Studiengang BSc Geographie gibt es Basismodule wie 'Basiswissen: Wirtschafts- und Dienstleistungsgeographie' mit 3 Leistungspunkten, 'Fernerkundung' mit 3 Leistungspunkten und 'Geoinformatik' mit 3 Leistungspunkten. Weitere Basismodule umfassen verschiedene Grundkompetenzen wie 'Bevölkerungsgeographie', 'Biogeographie', 'Bodengeographie', 'Geographie der peripheren Räume', 'Geomorphologie', 'Hydrogeographie', 'Klimageographie', 'Mensch und Umwelt', 'Raumordnung und Raumplanung', 'Stadtgeographie' und 'Wirtschafts- und Dienstleistungsgeographie', jeweils mit 6 Leistungspunkten. Das Modul 'Kartographie und GIS' ist ebenfalls ein Basismodul mit 6 Leistungspunkten. Es gibt Vertiefungsmodule wie 'Projekt der Geographie I' und 'Projekt der Geographie II', beide mit 6 Leistungspunkten. 'Spezielle Kartographie' und 'Systemdynamik' sind Basismodule mit jeweils 3 Leistungspunkten.",
      "token_count": 429,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          51,
          52
        ],
        "chunk_index": 58,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0057",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0059"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0059",
      "text": "Weitere Basismodule umfassen verschiedene Grundkompetenzen wie 'Bevölkerungsgeographie', 'Biogeographie', 'Bodengeographie', 'Geographie der peripheren Räume', 'Geomorphologie', 'Hydrogeographie', 'Klimageographie', 'Mensch und Umwelt', 'Raumordnung und Raumplanung', 'Stadtgeographie' und 'Wirtschafts- und Dienstleistungsgeographie', jeweils mit 6 Leistungspunkten. Das Modul 'Kartographie und GIS' ist ebenfalls ein Basismodul mit 6 Leistungspunkten. Es gibt Vertiefungsmodule wie 'Projekt der Geographie I' und 'Projekt der Geographie II', beide mit 6 Leistungspunkten. 'Spezielle Kartographie' und 'Systemdynamik' sind Basismodule mit jeweils 3 Leistungspunkten. Für den MSc Physische Geographie sind Aufbaumodule wie 'Biogeographie', 'Boden- und Hydrogeographie', 'Geländeklimatologie', 'Geographische Informationssysteme', 'Geomorphologie' und 'Umweltsysteme' mit jeweils 6 Leistungspunkten vorgesehen. 'Globaler Wandel' ist ein Basismodul mit 6 Leistungspunkten. 'Umweltinformationssysteme I' ist ein Vertiefungsmodul mit 6 Leistungspunkten, während 'Umweltinformationssysteme II' ein Aufbaumodul mit 6 Leistungspunkten ist. Im MSc Wirtschaftsgeographie gibt es Basismodule wie 'Globalisierung von Innovation und Wissen', 'Innovation und Wachstum im Raum' und 'Sozioökonomische Globalisierungsprozesse', sowie ein Aufbaumodul 'Modellierung und Simulation', alle mit 6 Leistungspunkten. Die Seite listet Module auf, die für den Bereich 'Profile Area Mathematics' verwendet werden können. Diese Module stammen aus verschiedenen Studiengängen der Mathematik und Informatik.",
      "token_count": 482,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          52,
          53
        ],
        "chunk_index": 59,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0058",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0060"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0060",
      "text": "Im MSc Wirtschaftsgeographie gibt es Basismodule wie 'Globalisierung von Innovation und Wissen', 'Innovation und Wachstum im Raum' und 'Sozioökonomische Globalisierungsprozesse', sowie ein Aufbaumodul 'Modellierung und Simulation', alle mit 6 Leistungspunkten. Die Seite listet Module auf, die für den Bereich 'Profile Area Mathematics' verwendet werden können. Diese Module stammen aus verschiedenen Studiengängen der Mathematik und Informatik. Zum Beispiel wird das Modul 'Matrixmethoden in der Datenanalyse' als Aufbaumodul mit 9 Leistungspunkten angeboten. Weitere Module wie 'Algebra', 'Darstellungstheorie' und 'Diskrete Geometrie' sind ebenfalls Aufbaumodule mit jeweils 9 Leistungspunkten. Es gibt auch Vertiefungsmodule wie 'Algebraic Geometry: Projective Varieties' und 'Analytic Number Theory', die jeweils 9 Leistungspunkte umfassen. Die Seite listet verschiedene Module für die Studiengänge MSc Mathematik, BSc Wirtschaftsmathematik und MSc Wirtschaftsmathematik auf. Für den MSc Mathematik gibt es Vertiefungsmodule wie 'Large Specialization Module Numerical Mathematics/Optimization' und 'Holomorphic Functions and Abelian Varieties', die jeweils 9 Leistungspunkte umfassen. Weitere Module sind 'Small Specialization Module Algebra/Geometry' und 'Small Specialization Module Analysis/Topology', die jeweils 6 Leistungspunkte haben. Im BSc Wirtschaftsmathematik sind Aufbaumodule wie 'Elementare Stochastik' und 'Finanzmathematik I' mit 9 bzw. 6 Leistungspunkten enthalten. Der MSc Wirtschaftsmathematik bietet Vertiefungsmodule wie 'Selected Topics on Financial Mathematics' mit 3 Leistungspunkten und 'Financial Optimization' mit 6 Leistungspunkten. Weitere Module umfassen 'Large Specialization Module Stochastics' und 'Small Specialization Module Stochastics', die 9 bzw. 6 Leistungspunkte umfassen. Die Seite beschreibt Module, die für die Profile Area Physics und Profile Area Economics verwendet werden können.",
      "token_count": 509,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          52,
          53,
          54,
          55
        ],
        "chunk_index": 60,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0059",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0061"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0061",
      "text": "Der MSc Wirtschaftsmathematik bietet Vertiefungsmodule wie 'Selected Topics on Financial Mathematics' mit 3 Leistungspunkten und 'Financial Optimization' mit 6 Leistungspunkten. Weitere Module umfassen 'Large Specialization Module Stochastics' und 'Small Specialization Module Stochastics', die 9 bzw. 6 Leistungspunkte umfassen. Die Seite beschreibt Module, die für die Profile Area Physics und Profile Area Economics verwendet werden können. Für die Profile Area Physics werden die Module 'Experimentalphysik für Naturwissenschaften I' und 'Experimentalphysik für Naturwissenschaften II' angeboten, beide als Basismodule mit jeweils 6 Leistungspunkten. Für die Profile Area Economics gibt es eine Vielzahl von Modulen, darunter 'Angewandte Institutionenökonomie', 'Development Economics: An Introduction', 'Einführung in die Institutionenökonomie', 'Einführung in die Volkswirtschaftslehre', 'Einführung in Law and Economics', 'Empirische Wirtschaftsforschung', 'Grundlagen der Finanzwissenschaft', 'International Economics', 'Macroeconomics II', 'Makroökonomie I', 'Markets and Organizations', 'Microeconomics II', 'Mikroökonomie I', 'Umweltökonomik', 'Wettbewerb und Regulierung' und 'Wirtschaftspolitik'. Diese Module sind als Exportmodule gekennzeichnet und variieren in der Niveaustufe von Basis- bis Vertiefungsmodulen, jeweils mit 6 Leistungspunkten. Anlage 4 behandelt die Exportmodulliste. Das aktuelle Exportangebot wird auf der Studiengangswebseite des modularen Fachbereichs veröffentlicht. Eventuelle Teilnahmevoraussetzungen oder -empfehlungen sowie Kombinationsregelungen sind zu beachten. Sollte der Fachbereich Kombinationsregelungen vorgeben und Exportpakete gebildet haben, steht je nach Umfang des eigenen Importfensters nur ein begrenztes Modulangebot zur Verfügung. Die Auflistung stellt das Exportangebot zur Zeit der Beschlussfassung über diese Studien- und Prüfungsordnung dar.",
      "token_count": 502,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          54,
          55,
          56
        ],
        "chunk_index": 61,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0060",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0062"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0062",
      "text": "Eventuelle Teilnahmevoraussetzungen oder -empfehlungen sowie Kombinationsregelungen sind zu beachten. Sollte der Fachbereich Kombinationsregelungen vorgeben und Exportpakete gebildet haben, steht je nach Umfang des eigenen Importfensters nur ein begrenztes Modulangebot zur Verfügung. Die Auflistung stellt das Exportangebot zur Zeit der Beschlussfassung über diese Studien- und Prüfungsordnung dar. Der Katalog des Exportangebots kann vom Prüfungsausschuss geändert oder ergänzt werden, wenn sich das Exportangebot ändert. Solche Änderungen werden vom Prüfungsausschuss auf der Studiengangswebseite gemäß § 6 veröffentlicht. § 1 Export curricularer Module in andere Studiengänge: Folgende Module gemäß Anlage 2 können im Rahmen anderer Studiengänge absolviert werden, sofern dies mit dem Fachbereich bzw. den Fachbereichen vereinbart ist, in dessen/deren Studiengang diese Module wählbar sind. Die Module umfassen unter anderem 'Deutsche Übersetzung', 'Advanced Algorithmics' (CS 627), 'Advanced Methods of System Development' (CS 607), 'Advanced Programming Concepts' (CS 609), 'Advanced Topics in Cryptography' (CS 556), 'Algorithm Engineering' (CS 628), 'Algorithmic Network Analysis' (CS 529), 'Algorithms in Bioinformatics' (CS 594), 'Artificial Intelligence' (CS 592), 'Compiler Construction' (CS 551), 'Computational complexity theory' (CS 576) und 'Content-based Image and Video Analysis' (CS 516). Die Seite enthält eine Liste von Modulen mit ihren Bezeichnungen und den zugehörigen Modulnummern. Zum Beispiel wird das Modul 'Inhaltsbasierte Bild- und Videoanalyse' mit der Modulnummer CS 569 aufgeführt. Weitere Module sind 'Dialog Systems' (CS 569), 'Distributed Systems' (CS 513), 'Ethical Hacking and Practical Cryptanalysis' (CS 575) und 'Formal Methods in Software Engineering' (CS 510).",
      "token_count": 495,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          56,
          57
        ],
        "chunk_index": 62,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0061",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0063"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0063",
      "text": "Die Seite enthält eine Liste von Modulen mit ihren Bezeichnungen und den zugehörigen Modulnummern. Zum Beispiel wird das Modul 'Inhaltsbasierte Bild- und Videoanalyse' mit der Modulnummer CS 569 aufgeführt. Weitere Module sind 'Dialog Systems' (CS 569), 'Distributed Systems' (CS 513), 'Ethical Hacking and Practical Cryptanalysis' (CS 575) und 'Formal Methods in Software Engineering' (CS 510). Die Liste umfasst auch spezialisierte Module wie 'Large Specialization Module Computer Science 1' (CS 647) und 'Small Specialization Module Computer Science 1' (CS 549). Die Seite listet verschiedene Module des Studiengangs auf. Dazu gehören 'Kleines Vertiefungsmodul Informatik 2', 'Small Specialization Module Computer Science 3' mit der Modulnummer CS 644, 'Small Specialization Module Computer Science 4' mit der Modulnummer CS 646, und 'Small Specialization Module Computer Science 5' mit der Modulnummer CS 645. Weitere Module sind 'Software as a Medical Device' (Software als Medizinprodukt) mit der Modulnummer CS 558, 'Software Evolution' mit der Modulnummer CS 563, 'Statistical Bioinformatics' (Statistische Bioinformatik) mit der Modulnummer CS 543, 'Virtual Machines' (Virtuelle Maschinen) mit der Modulnummer CS 530, 'Visual Languages' (Visuelle Sprachen) mit der Modulnummer CS 562, und 'Web Technologies' (Webtechnologien) mit der Modulnummer CS 533.\n\nIn Anlage 5 werden die besonderen Zugangsvoraussetzungen und das Eignungsfeststellungsverfahren für den Masterstudiengang 'Computer Science' beschrieben. § 1 legt fest, dass Bewerberinnen und Bewerber die allgemeinen Zugangsvoraussetzungen gemäß § 4 der Studien- und Prüfungsordnung erfüllen müssen. Zusätzlich ist die persönliche fachbezogene Eignung nachzuweisen. § 2 beschreibt den Antrag auf Teilnahme am Eignungsfeststellungsverfahren.",
      "token_count": 504,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          57,
          58,
          59
        ],
        "chunk_index": 63,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0062",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0064"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0064",
      "text": "Dazu gehören 'Kleines Vertiefungsmodul Informatik 2', 'Small Specialization Module Computer Science 3' mit der Modulnummer CS 644, 'Small Specialization Module Computer Science 4' mit der Modulnummer CS 646, und 'Small Specialization Module Computer Science 5' mit der Modulnummer CS 645. Weitere Module sind 'Software as a Medical Device' (Software als Medizinprodukt) mit der Modulnummer CS 558, 'Software Evolution' mit der Modulnummer CS 563, 'Statistical Bioinformatics' (Statistische Bioinformatik) mit der Modulnummer CS 543, 'Virtual Machines' (Virtuelle Maschinen) mit der Modulnummer CS 530, 'Visual Languages' (Visuelle Sprachen) mit der Modulnummer CS 562, und 'Web Technologies' (Webtechnologien) mit der Modulnummer CS 533.\n\nIn Anlage 5 werden die besonderen Zugangsvoraussetzungen und das Eignungsfeststellungsverfahren für den Masterstudiengang 'Computer Science' beschrieben. § 1 legt fest, dass Bewerberinnen und Bewerber die allgemeinen Zugangsvoraussetzungen gemäß § 4 der Studien- und Prüfungsordnung erfüllen müssen. Zusätzlich ist die persönliche fachbezogene Eignung nachzuweisen. § 2 beschreibt den Antrag auf Teilnahme am Eignungsfeststellungsverfahren. Der Antrag muss ein bestimmtes Formular verwenden und folgende Unterlagen enthalten: Nachweis über ein abgeschlossenes fachlich einschlägiges Bachelor-Studium oder einen gleichwertigen Abschluss, Nachweis über eine wissenschaftliche Abschlussarbeit, Nachweis über die in § 4 Abs. 1 Sätze 4 bis 7 genannten Kompetenzen, Nachweis über Sprachkenntnisse in Deutsch und/oder Englisch, sowie ein vollständig ausgefülltes Formular mit Angaben zu bisherigen Modulen und Sprachzertifikaten.",
      "token_count": 464,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          58,
          59
        ],
        "chunk_index": 64,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0063",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0065"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0065",
      "text": "Der Antrag muss ein bestimmtes Formular verwenden und folgende Unterlagen enthalten: Nachweis über ein abgeschlossenes fachlich einschlägiges Bachelor-Studium oder einen gleichwertigen Abschluss, Nachweis über eine wissenschaftliche Abschlussarbeit, Nachweis über die in § 4 Abs. 1 Sätze 4 bis 7 genannten Kompetenzen, Nachweis über Sprachkenntnisse in Deutsch und/oder Englisch, sowie ein vollständig ausgefülltes Formular mit Angaben zu bisherigen Modulen und Sprachzertifikaten. § 3 erläutert die Zusammensetzung und Aufgaben der Eignungsfeststellungskommission, die aus mindestens zwei Professorinnen oder Professoren besteht und dem Fachbereichsrat berichtet. § 4 beschreibt das Eignungsfeststellungsverfahren, an dem nur vollständig und fristgerecht eingereichte Bewerbungen teilnehmen. Die Feststellung der Eignung erfolgt aufgrund bestimmter Kriterien. Erstens, für die Gesamtnote werden Punkte wie folgt vergeben: Eine Note von 15,0 bis 12,7 entspricht 55 Punkten, 12,6 bis 10,0 entspricht 45 Punkten, und 9,9 bis 7,3 entspricht 35 Punkten. Diese Angaben basieren auf der Notenskala der Philipps-Universität Marburg. Zweitens, die Anfertigung einer wissenschaftlichen Abschlussarbeit im Rahmen eines fachlich einschlägigen Bachelorstudiengangs ist erforderlich. Diese muss mindestens 10 Leistungspunkte umfassen oder eine entsprechende Abschlussarbeit muss bereits erbracht oder verbindlich angemeldet sein. Drittens, der Nachweis von Kenntnissen gemäß § 4 Abs. 1 Satz 7 der Studien- und Prüfungsordnung ist notwendig. Die Eignungsfeststellungskommission bewertet, ob Kompetenzen in mindestens 7 von 7 Modulen oder 6 von 7 Modulen erworben wurden, was 35 bzw. 20 Punkte ergibt.",
      "token_count": 495,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          59,
          60
        ],
        "chunk_index": 65,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0064",
        "next_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0066"
      }
    },
    {
      "chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0066",
      "text": "Diese muss mindestens 10 Leistungspunkte umfassen oder eine entsprechende Abschlussarbeit muss bereits erbracht oder verbindlich angemeldet sein. Drittens, der Nachweis von Kenntnissen gemäß § 4 Abs. 1 Satz 7 der Studien- und Prüfungsordnung ist notwendig. Die Eignungsfeststellungskommission bewertet, ob Kompetenzen in mindestens 7 von 7 Modulen oder 6 von 7 Modulen erworben wurden, was 35 bzw. 20 Punkte ergibt. Für die Zulassung zum Studium ist eine Mindestbewertung von 65 von 100 Punkten erforderlich. Über die wesentlichen Kriterien wird ein Protokoll erstellt. § 5 beschreibt den Abschluss des Verfahrens. Zugelassene Bewerber erhalten einen schriftlichen Zulassungsbescheid mit einer Frist zur Einschreibung. Bei Nichterfüllung wird der Bescheid unwirksam. Abgelehnte Bewerber können sich erneut bewerben, wenn weitere relevante Leistungen erbracht wurden.",
      "token_count": 258,
      "metadata": {
        "document_id": "2-aend-19-02-25_msc-computer-science_lese",
        "document_title": "Studien- und Prüfungsordnung für den Studiengang 'Computer Science' mit dem Abschluss 'Master of Science (M.Sc.)'",
        "document_type": "pruefungsordnung",
        "institution": "Philipps-Universität Marburg",
        "degree_program": "Computer Science M.Sc.",
        "page_numbers": [
          60
        ],
        "chunk_index": 66,
        "total_chunks": 67,
        "prev_chunk_id": "2-aend-19-02-25_msc-computer-science_lese_chunk_0065",
        "next_chunk_id": null
      }
    }
  ],
  "stats": {
    "total_chunks": 67,
    "total_tokens": 32095,
    "avg_chunk_tokens": 479.02985074626866,
    "min_chunk_tokens": 258,
    "max_chunk_tokens": 510,
    "total_sentences": 654,
    "total_pages_processed": 60
  },
  "created_at": "2026-02-03T20:32:06.054576"
}